99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
#include "esp32_mquickjs_wifi_enterprise.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_memory_rtos.h"
#include "esp32_mquickjs_wifi_roaming.h"
#include "esp32_mquickjs_wifi_neighbor_request.h"
#include "esp32_mquickjs_wifi_rrm_request.h"
#include "esp32_mquickjs_wifi_eap_radio.h"
#include "esp32_mquickjs_wifi_smartconfig_session.h"
#include "esp32_mquickjs_wifi_wps_station.h"
#include "esp32_mquickjs_wifi_dpp_station.h"
#include "esp32_mquickjs_wifi_dpp_session.h"
#include "esp32_mquickjs_wifi_nan_session.h"
#include "esp32_mquickjs_wifi_nan.h"
#include "esp32_mquickjs_wifi_mesh.h"
#include "esp32_mquickjs_wifi_mesh_session.h"
#include "esp32_mquickjs_wifi_dpp.h"
#include "esp32_mquickjs_wifi_wps_ap_radio.h"
#include "esp32_mquickjs_wifi_wps_ap_session.h"
#include "esp32_mquickjs_wifi_wps_session.h"
#include "esp32_mquickjs_wifi_smartconfig.h"
#include "esp32_mquickjs_wifi_wps.h"
#include "esp32_mquickjs_wifi_wps_ap.h"
#include "esp32_mquickjs_wifi_smartconfig_connection.h"
#include "esp32_mquickjs_wifi_eap_config.h"
#include "esp32_mquickjs_wifi_raw_tx_ap.h"
#include "esp32_mquickjs_wifi_ftm_session.h"
#include "esp32_mquickjs_wifi_ftm.h"
#include "esp32_mquickjs_wifi_twt.h"
#include "esp32_mquickjs_wifi_action_radio.h"
#include "esp32_mquickjs_wifi_vendor_ie_watch.h"
#include "esp32_mquickjs_wifi_vendor_ie.h"
#include "esp32_mquickjs_wifi_wait.h"
#include "esp32_mquickjs_wifi_wapi_radio.h"
#include "esp32_mquickjs_wifi.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_net.h"
#include "esp32_mquickjs_wifi_netif.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_wifi_raw_tx.h"
#include "esp32_mquickjs_wifi_action.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp32_mquickjs_wifi_runtime_resources.h"

#include <math.h>
#include <stdio.h>
#include <string.h>

#include "esp_check.h"
#include "esp_event.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_netif.h"
#include "esp_netif_net_stack.h"
#include "esp_netif_private.h"
#include "esp_private/wifi.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "esp_wifi_default.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lwip/netif.h"

#define WIFI_CONNECTED_BIT BIT0
#define WIFI_FAILED_BIT BIT1
#define WIFI_STARTED_BIT BIT2
#define WIFI_LINK_DRAINED_BIT BIT3
#define WIFI_CONTROL_LINK_DRAINED 1

ESP_EVENT_DEFINE_BASE(ESP32QJS_WIFI_CONTROL_EVENT);
#define WIFI_SCAN_EVENT_QUEUE_LEN 1
#define WIFI_CONNECT_EVENT_QUEUE_LEN 1
#define WIFI_DRIVER_EVENT_QUEUE_LEN 8
#define WIFI_SCAN_BSSID_STR_LEN 18

static const char *TAG = "esp32qjs_wifi";

static esp32_mquickjs_wifi_state_t s_wifi_state;
/* Observation history survives helper teardown/runtime restart. The association
 * marker is not a resettable counter and never drives a reconnect policy. */
static portMUX_TYPE s_wifi_connection_counters_lock = portMUX_INITIALIZER_UNLOCKED;
static struct {
    uint32_t attempts, reconnect_attempts, submission_failures, associations;
    bool ever_associated;
} s_wifi_connection_counters;

static void wifi_connection_counter_add(uint32_t *counter)
{
    if (*counter != UINT32_MAX) ++*counter;
}

static void wifi_connection_note_submit(void)
{
    portENTER_CRITICAL(&s_wifi_connection_counters_lock);
    wifi_connection_counter_add(&s_wifi_connection_counters.attempts);
    if (s_wifi_connection_counters.ever_associated)
        wifi_connection_counter_add(&s_wifi_connection_counters.reconnect_attempts);
    portEXIT_CRITICAL(&s_wifi_connection_counters_lock);
}

static void wifi_connection_note_failure(void)
{
    portENTER_CRITICAL(&s_wifi_connection_counters_lock);
    wifi_connection_counter_add(&s_wifi_connection_counters.submission_failures);
    portEXIT_CRITICAL(&s_wifi_connection_counters_lock);
}

static void wifi_connection_note_association(void)
{
    portENTER_CRITICAL(&s_wifi_connection_counters_lock);
    s_wifi_connection_counters.ever_associated = true;
    wifi_connection_counter_add(&s_wifi_connection_counters.associations);
    portEXIT_CRITICAL(&s_wifi_connection_counters_lock);
}

void esp32_mquickjs_wifi_reset_connection_counters(void)
{
    portENTER_CRITICAL(&s_wifi_connection_counters_lock);
    s_wifi_connection_counters.attempts = 0;
    s_wifi_connection_counters.reconnect_attempts = 0;
    s_wifi_connection_counters.submission_failures = 0;
    s_wifi_connection_counters.associations = 0;
    portEXIT_CRITICAL(&s_wifi_connection_counters_lock);
}

static JSValue wifi_connection_counters_to_js(JSContext *ctx)
{
    uint32_t attempts, reconnects, failures, associations;
    portENTER_CRITICAL(&s_wifi_connection_counters_lock);
    attempts = s_wifi_connection_counters.attempts;
    reconnects = s_wifi_connection_counters.reconnect_attempts;
    failures = s_wifi_connection_counters.submission_failures;
    associations = s_wifi_connection_counters.associations;
    portEXIT_CRITICAL(&s_wifi_connection_counters_lock);
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "attempts", JS_NewUint32(ctx, attempts)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "reconnectAttempts", JS_NewUint32(ctx, reconnects)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "submissionFailures", JS_NewUint32(ctx, failures)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "associations", JS_NewUint32(ctx, associations))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
/* Helper lock protects native registration and terminal metadata. Outside
 * resettable helper storage; core must retire this owner before helper reset. */
static struct {
    esp32_mquickjs_wifi_radio_operation_t owner;
    uint32_t generation, terminal;
    int32_t reason;
} s_wifi_smartconfig_connect;
/* Boot identities live outside resettable helper storage. */
static uint32_t s_wifi_wps_capture_identity;
static uint32_t s_wifi_wps_next_identity = 1;
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
static uint32_t s_wifi_wps_ap_helper_identity;
static uint32_t s_wifi_wps_ap_next_helper_identity = 1;
#endif
#endif

static esp32_mquickjs_wifi_radio_lease_t s_wifi_application;
static esp32_mquickjs_wifi_radio_lifecycle_t s_wifi_lifecycle;
/* Outside resettable helper storage: a failed final shutdown still owns the
 * exact AP/STA configuration transaction after both netifs have been freed. */
static bool s_wifi_configuration_cleanup;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static struct {
    esp32_mquickjs_wifi_eap_config_token_t control;
    uint64_t binding;
    esp32_mquickjs_wifi_eap_profile_t *profile; /* Borrowed from the exact restart control. */
    bool release_ap, checkpoint_attempted;
} s_wifi_eap_stop;
#endif
static bool s_wifi_ap_stop_cleanup;
static wifi_mode_t s_wifi_configuration_mode;
/* An admitted ordinary stop retains driver allocations. Keep this choice
 * outside helper reset so retries cannot silently become a shutdown. */
static bool s_wifi_configuration_stop_only;
static bool s_wifi_configuration_disconnect_pending;
/* Keep the last helper setup failure visible even after successful unwind. */
static const char *s_wifi_setup_stage;
static esp_err_t s_wifi_setup_error;
static _Atomic(esp32_mquickjs_runtime_t *) s_wifi_runtime;
static void wifi_stop_connect_timeout_timer(void);
static void wifi_release_radio_operation(void);
/* A timer callback may outlive public cancellation. Its generation is not
 * rebound until stop_blocking proves the previous callback has exited. */
static _Atomic uint32_t s_wifi_timeout_armed_generation;
static void wifi_lock(void);
static void wifi_unlock(void);
static _Atomic uint32_t s_wifi_timeout_pending;
/* Control callbacks publish observations themselves, after committing native state.
 * The generic observer skips these IDs even if it registered before this helper. */
static _Atomic uint32_t s_wifi_watch_control_mask;

bool esp32_mquickjs_wifi_watch_controlled(int32_t id)
{
    return id >= 0 && id < 32 &&
        (atomic_load_explicit(&s_wifi_watch_control_mask, memory_order_acquire) & (1U << id)) != 0;
}

bool esp32_mquickjs_wifi_watch_control_ready(int32_t id, uint32_t generation)
{
    if (generation == 0) return true;
    wifi_lock();
    bool pending = id == WIFI_EVENT_SCAN_DONE
        ? s_wifi_state.scan_generation == generation && s_wifi_state.scan_future_registered
        : id == WIFI_EVENT_STA_DISCONNECTED &&
          s_wifi_state.connect_generation == generation && esp32_mquickjs_wifi_connection_reserved_locked();
    wifi_unlock();
    return !pending;
}

