99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
typedef enum {
    WIFI_DRIVER_EVENT_STARTED = 1,
    WIFI_DRIVER_EVENT_DISCONNECTED,
    WIFI_DRIVER_EVENT_SCAN_DONE,
    WIFI_DRIVER_EVENT_GOT_IP,
    WIFI_DRIVER_EVENT_CONNECT_TIMEOUT,
    WIFI_DRIVER_EVENT_LINK_DRAINED,
} esp32_mquickjs_wifi_driver_event_kind_t;

typedef struct {
    esp32_mquickjs_wifi_driver_event_kind_t kind;
    int32_t reason;
    uint32_t status;
    uint32_t generation;
} esp32_mquickjs_wifi_driver_event_t;

static bool wifi_driver_event_poller(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime,
                                     void *opaque);

static void *wifi_create_lock(void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_mutex_create("wifi");
}

static void wifi_delete_lock(void *value, void *opaque)
{
    (void)opaque;
    esp32_mquickjs_memory_mutex_delete((SemaphoreHandle_t)value);
}

static void *wifi_create_event_group(void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_event_group_create("wifi");
}

static void wifi_delete_event_group(void *value, void *opaque)
{
    (void)opaque;
    esp32_mquickjs_memory_event_group_delete((EventGroupHandle_t)value);
}

static void *wifi_create_queue(size_t length, size_t item_size, void *opaque)
{
    (void)opaque;
    return esp32_mquickjs_memory_queue_create("wifi", length, item_size, true);
}

static void wifi_delete_queue(void *value, void *opaque)
{
    (void)opaque;
    esp32_mquickjs_memory_queue_delete((QueueHandle_t)value);
}

static const esp32_mquickjs_wifi_runtime_resource_ops_t
    s_wifi_runtime_resource_ops = {
        .create_lock = wifi_create_lock,
        .delete_lock = wifi_delete_lock,
        .create_event_group = wifi_create_event_group,
        .delete_event_group = wifi_delete_event_group,
        .create_queue = wifi_create_queue,
        .delete_queue = wifi_delete_queue,
    };

esp32_mquickjs_wifi_state_t *esp32_mquickjs_wifi_state(void)
{
    return &s_wifi_state;
}

static void wifi_lock(void)
{
    if (s_wifi_state.lock != NULL) {
        xSemaphoreTake(s_wifi_state.lock, portMAX_DELAY);
    }
}

static void wifi_unlock(void)
{
    if (s_wifi_state.lock != NULL) {
        xSemaphoreGive(s_wifi_state.lock);
    }
}

void esp32_mquickjs_wifi_lock(void)
{
    wifi_lock();
}

void esp32_mquickjs_wifi_unlock(void)
{
    wifi_unlock();
}

bool esp32_mquickjs_wifi_connection_reserved_locked(void)
{
    return s_wifi_state.connect_future_registered
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
        || s_wifi_smartconfig_connect.owner.identity != 0 || s_wifi_wps_capture_identity != 0
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
        || s_wifi_wps_ap_helper_identity != 0
#endif
#endif
        ;
}

void esp32_mquickjs_wifi_clear_scan_future(void)
{
    wifi_lock();
    s_wifi_state.scan_future_registered = false;
    memset(&s_wifi_state.scan_future_token, 0, sizeof(s_wifi_state.scan_future_token));
    wifi_unlock();
}

void esp32_mquickjs_wifi_clear_connect_future(void)
{
    wifi_stop_connect_timeout_timer();
    wifi_lock();
    s_wifi_state.connect_in_progress = false;
    s_wifi_state.connect_future_registered = false;
    s_wifi_state.connection_future_operation =
        ESP32_MQUICKJS_WIFI_OPERATION_NONE;
    memset(&s_wifi_state.connect_future_token, 0, sizeof(s_wifi_state.connect_future_token));
    wifi_unlock();
    wifi_release_radio_operation();
}

static void wifi_stop_connect_timeout_timer(void)
{
    atomic_store_explicit(&s_wifi_timeout_armed_generation, 0, memory_order_release);
    if (s_wifi_state.connect_timeout_timer == NULL) {
        return;
    }

    esp_err_t err = esp_timer_stop(s_wifi_state.connect_timeout_timer);
    if (err == ESP_ERR_INVALID_STATE) {
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "esp_timer_stop(connect_timeout_timer) failed: %s", esp_err_to_name(err));
    }
}

static void wifi_queue_connect_event(uint32_t generation,
                                     uint32_t kind,
                                     int32_t reason,
                                     const esp32_mquickjs_wifi_link_snapshot_t *link)
{
    esp32_mquickjs_future_token_t token = {0};
    bool should_wake = false;
    esp32_mquickjs_wifi_connect_event_t event = {
        .generation = generation,
        .kind = kind,
        .reason = reason,
        .completed_us = esp_timer_get_time(),
    };
    if (link != NULL) event.link = *link;
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    wifi_lock();
    if (s_wifi_smartconfig_connect.owner.identity && s_wifi_smartconfig_connect.generation == generation &&
        !s_wifi_smartconfig_connect.terminal) {
        s_wifi_smartconfig_connect.terminal = kind;
        s_wifi_smartconfig_connect.reason = reason;
    }
    wifi_unlock();
#endif

    if (s_wifi_state.connect_queue != NULL) {
        wifi_lock();
        should_wake = s_wifi_state.connect_future_registered &&
            s_wifi_state.connect_generation == generation;
        if (should_wake) {
            xQueueOverwrite(s_wifi_state.connect_queue, &event);
            token = s_wifi_state.connect_future_token;
        }
        wifi_unlock();
        esp32_mquickjs_runtime_t *runtime = atomic_load_explicit(&s_wifi_runtime, memory_order_acquire);
        if (runtime != NULL) {
            if (should_wake) (void)esp32_mquickjs_future_wake(runtime, token);
            esp32_mquickjs_notify_activity(runtime);
        }
    }
}

static void wifi_process_driver_event(
    const esp32_mquickjs_wifi_driver_event_t *driver_event);

static bool wifi_publish_driver_event_from_callback(
    const esp32_mquickjs_wifi_driver_event_t *event)
{
    if (event == NULL) return false;
    if (event->kind == WIFI_DRIVER_EVENT_CONNECT_TIMEOUT) {
        /* Timer callbacks never invoke Wi-Fi driver mutations. A coalesced
         * native obligation survives a full queue until the runtime polls. */
        if (event->generation != 0U)
            atomic_store_explicit(&s_wifi_timeout_pending, event->generation,
                                  memory_order_release);
    } else {
        /* ESP event-loop task: commit control state and Future results before
         * any lossy observation. No JS or Wi-Fi driver mutation in this path. */
        wifi_process_driver_event(event);
    }
    esp32_mquickjs_runtime_t *runtime = atomic_load_explicit(&s_wifi_runtime, memory_order_acquire);
    if (runtime != NULL) esp32_mquickjs_notify_activity(runtime);
    return true;
}

static void wifi_connect_timeout_cb(void *arg)
{
    const esp32_mquickjs_wifi_driver_event_t event = {
        .kind = WIFI_DRIVER_EVENT_CONNECT_TIMEOUT,
        .generation = atomic_load_explicit(&s_wifi_timeout_armed_generation,
                                            memory_order_acquire),
    };

    (void)arg;
    atomic_fetch_add_explicit(&s_wifi_state.callbacks_active, 1,
                              memory_order_acq_rel);
    (void)wifi_publish_driver_event_from_callback(&event);
    atomic_fetch_sub_explicit(&s_wifi_state.callbacks_active, 1,
                              memory_order_release);
}

static void wifi_set_scanning_locked(bool scanning)
{
    s_wifi_state.scan_in_progress = scanning;
    s_wifi_state.status.scanning = scanning;
}

void esp32_mquickjs_wifi_set_scanning_locked(bool scanning)
{
    wifi_set_scanning_locked(scanning);
}

