99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
/* Runtime task only. Callbacks never wait on the Radio mutation mutex.
 * A public Future ending is insufficient: retain the reservation through
 * SDK submission, terminal events and any pending native cleanup. */
static void wifi_release_radio_operation(void)
{
    esp32_mquickjs_wifi_radio_operation_t released = {0};
    wifi_lock();
    bool ready = s_wifi_state.radio_operation.kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SCAN
        ? !s_wifi_state.scan_start_active && !s_wifi_state.scan_in_progress &&
          !s_wifi_state.scan_stop_active && !s_wifi_state.scan_draining && !s_wifi_state.scan_results_pending
        : !s_wifi_state.connect_start_active && !s_wifi_state.connect_in_progress &&
          !s_wifi_state.connect_draining && !s_wifi_state.disconnect_active;
    if (ready) {
        released = s_wifi_state.radio_operation;
        memset(&s_wifi_state.radio_operation, 0, sizeof(s_wifi_state.radio_operation));
    }
    wifi_unlock();
    esp32_mquickjs_wifi_radio_end_operation(&released);
}

static esp_err_t wifi_prepare_radio_operation(esp32_mquickjs_wifi_radio_operation_kind_t kind)
{
    wifi_release_radio_operation();
    wifi_lock();
    bool reserved = s_wifi_state.radio_operation.identity != 0U;
    bool handoff = reserved && kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_CONNECT &&
        s_wifi_state.radio_operation.kind == kind;
    wifi_unlock();
    /* A cancelled connect retains the same reservation throughout handoff. */
    if (reserved) return handoff ? ESP_OK : ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_radio_operation_t operation = {0};
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_operation(
        &s_wifi_state.radio_lease, kind, &operation);
    if (err == ESP_OK) {
        wifi_lock();
        s_wifi_state.radio_operation = operation;
        wifi_unlock();
    }
    return err;
}

/* Called only by the runtime task; callbacks publish terminal state but never
 * clear driver results or submit another scan. No SDK calls under wifi_lock. */
esp_err_t esp32_mquickjs_wifi_drain_scan(void)
{
    wifi_lock();
    if (!s_wifi_state.scan_draining || s_wifi_state.scan_in_progress ||
        s_wifi_state.scan_stop_active) {
        wifi_unlock();
        return ESP_OK;
    }
    bool clear_results = s_wifi_state.scan_results_pending;
    wifi_unlock();
    esp_err_t err = clear_results ? esp_wifi_clear_ap_list() : ESP_OK;
    wifi_lock();
    s_wifi_state.scan_cleanup_error = err;
    if (err == ESP_OK) {
        s_wifi_state.scan_results_pending = false;
        s_wifi_state.scan_draining = false;
        s_wifi_state.scan_stop_submitted = false;
        memset(&s_wifi_state.native_scan_config, 0,
               sizeof(s_wifi_state.native_scan_config));
        memset(s_wifi_state.native_scan_ssid, 0, sizeof(s_wifi_state.native_scan_ssid));
        memset(s_wifi_state.native_scan_bssid, 0, sizeof(s_wifi_state.native_scan_bssid));
    }
    wifi_unlock();
    wifi_release_radio_operation();
    return err;
}

static esp_err_t wifi_start_scan_reserved(const wifi_scan_config_t *config,
                                       uint32_t generation)
{
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    size_t ssid_length = config->ssid != NULL ? strnlen((const char *)config->ssid, 33) : 0;
    if (config->ssid != NULL && (ssid_length == 0 || ssid_length > 32)) return ESP_ERR_INVALID_ARG;
    wifi_lock();
    if (!s_wifi_state.scan_future_registered ||
        generation != s_wifi_state.scan_generation ||
        s_wifi_state.scan_in_progress || s_wifi_state.scan_draining ||
        s_wifi_state.scan_results_pending || s_wifi_state.scan_stop_active ||
        s_wifi_state.connect_in_progress || s_wifi_state.connect_draining) {
        wifi_unlock();
        return ESP_ERR_INVALID_STATE;
    }
    s_wifi_state.native_scan_config = *config;
    /* Transfer filters into the native lane before publishing scan-in-progress.
     * A cancelled Future may free its own request before native SCAN_DONE. */
    memset(s_wifi_state.native_scan_ssid, 0, sizeof(s_wifi_state.native_scan_ssid));
    memset(s_wifi_state.native_scan_bssid, 0, sizeof(s_wifi_state.native_scan_bssid));
    if (config->ssid != NULL) {
        memcpy(s_wifi_state.native_scan_ssid, config->ssid, ssid_length);
        s_wifi_state.native_scan_config.ssid = s_wifi_state.native_scan_ssid;
    }
    if (config->bssid != NULL) {
        memcpy(s_wifi_state.native_scan_bssid, config->bssid, 6);
        s_wifi_state.native_scan_config.bssid = s_wifi_state.native_scan_bssid;
    }
    s_wifi_state.scan_cleanup_error = ESP_OK;
    s_wifi_state.scan_stop_submitted = false;
    wifi_set_scanning_locked(true);
    wifi_unlock();
    esp_err_t err = esp_wifi_scan_start(&s_wifi_state.native_scan_config, false);
    if (err != ESP_OK) {
        wifi_lock();
        wifi_set_scanning_locked(false);
        memset(&s_wifi_state.native_scan_config, 0,
               sizeof(s_wifi_state.native_scan_config));
        memset(s_wifi_state.native_scan_ssid, 0, sizeof(s_wifi_state.native_scan_ssid));
        memset(s_wifi_state.native_scan_bssid, 0, sizeof(s_wifi_state.native_scan_bssid));
        wifi_unlock();
    }
    return err;
}

esp_err_t esp32_mquickjs_wifi_start_scan(const wifi_scan_config_t *config,
                                       uint32_t generation)
{
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    if (config->ssid != NULL) {
        size_t length = strnlen((const char *)config->ssid, 33);
        if (length == 0 || length > 32) return ESP_ERR_INVALID_ARG;
    }
    if (config->bssid != NULL && ((config->bssid[0] & 1U) != 0U ||
        memcmp(config->bssid, "\0\0\0\0\0\0", 6) == 0)) return ESP_ERR_INVALID_ARG;
    esp_err_t err = wifi_prepare_radio_operation(ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SCAN);
    if (err != ESP_OK) return err;
    err = esp32_mquickjs_wifi_radio_validate_scan_channels(&s_wifi_state.radio_operation, config);
    if (err != ESP_OK) {
        wifi_release_radio_operation();
        return err;
    }
    wifi_lock();
    s_wifi_state.scan_start_active = true;
    wifi_unlock();
    err = wifi_start_scan_reserved(config, generation);
    wifi_lock();
    s_wifi_state.scan_start_active = false;
    wifi_unlock();
    wifi_release_radio_operation();
    return err;
}

esp_err_t esp32_mquickjs_wifi_cancel_scan(uint32_t generation)
{
    bool stop = false;
    wifi_lock();
    if (generation != s_wifi_state.scan_generation) {
        wifi_unlock();
        return ESP_OK;
    }
    s_wifi_state.scan_future_registered = false;
    memset(&s_wifi_state.scan_future_token, 0, sizeof(s_wifi_state.scan_future_token));
    s_wifi_state.scan_draining = s_wifi_state.scan_in_progress ||
        s_wifi_state.scan_results_pending || s_wifi_state.scan_stop_active;
    if (s_wifi_state.scan_in_progress && !s_wifi_state.scan_stop_submitted &&
        !s_wifi_state.scan_stop_active) {
        stop = true;
        s_wifi_state.scan_stop_active = true;
    }
    wifi_unlock();
    esp_err_t err = ESP_OK;
    if (stop) {
        err = esp_wifi_scan_stop();
        wifi_lock();
        s_wifi_state.scan_stop_active = false;
        s_wifi_state.scan_stop_submitted = err == ESP_OK;
        s_wifi_state.scan_cleanup_error = err;
        wifi_unlock();
    }
    esp_err_t cleanup_err = esp32_mquickjs_wifi_drain_scan();
    return err != ESP_OK ? err : cleanup_err;
}

void esp32_mquickjs_wifi_scan_results_consumed(void)
{
    wifi_lock();
    s_wifi_state.scan_results_pending = false;
    wifi_unlock();
    wifi_release_radio_operation();
}

