99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
/* The default STA disconnect handler was registered before ours. It waits
 * for netif/DHCP shutdown. A marker on that same FIFO loop then drains already
 * posted IP notifications before this link epoch can admit another connect. */
static void wifi_begin_disconnect_locked(void)
{
    if (!s_wifi_state.connect_draining) {
        s_wifi_state.connect_draining = true;
        s_wifi_state.disconnect_active = false;
        s_wifi_state.disconnect_submitted = false;
        s_wifi_state.disconnect_seen = false;
        s_wifi_state.disconnect_fence_posted = false;
        s_wifi_state.disconnect_fence_seen = false;
        if (s_wifi_state.disconnect_epoch == UINT32_MAX) {
            s_wifi_state.disconnect_epoch_exhausted = true;
            s_wifi_state.disconnect_cleanup_error = ESP_ERR_INVALID_STATE;
        } else {
            s_wifi_state.disconnect_epoch++;
            s_wifi_state.disconnect_cleanup_error = ESP_OK;
        }
    }
    s_wifi_state.connect_in_progress = false;
    s_wifi_state.status.connected = false;
    memset(&s_wifi_state.status.link, 0, sizeof(s_wifi_state.status.link));
}

static bool wifi_finish_disconnect_locked(void)
{
    if (!s_wifi_state.connect_draining || s_wifi_state.disconnect_active ||
        !s_wifi_state.disconnect_seen || !s_wifi_state.disconnect_fence_seen ||
        s_wifi_state.disconnect_epoch_exhausted) return false;
    s_wifi_state.connect_draining = false;
    s_wifi_state.disconnect_cleanup_error = ESP_OK;
    return true;
}

static esp_err_t wifi_post_disconnect_fence(void)
{
    wifi_lock();
    if (!s_wifi_state.connect_draining || !s_wifi_state.disconnect_seen ||
        s_wifi_state.disconnect_fence_posted || s_wifi_state.disconnect_epoch_exhausted) {
        esp_err_t err = s_wifi_state.disconnect_cleanup_error;
        wifi_unlock();
        return err;
    }
    uint32_t epoch = s_wifi_state.disconnect_epoch;
    s_wifi_state.disconnect_fence_posted = true;
    wifi_unlock();
    /* Roaming/IP-retention configurations or a failed netif down must not
     * masquerade as a completed DHCP shutdown barrier. */
    esp_err_t err = s_wifi_state.sta_netif != NULL &&
        !esp_netif_is_netif_up(s_wifi_state.sta_netif)
        ? esp_event_post(ESP32QJS_WIFI_CONTROL_EVENT, WIFI_CONTROL_LINK_DRAINED,
                         &epoch, sizeof(epoch), 0) : ESP_ERR_INVALID_STATE;
    wifi_lock();
    if (s_wifi_state.disconnect_epoch == epoch && s_wifi_state.connect_draining) {
        if (err != ESP_OK) s_wifi_state.disconnect_fence_posted = false;
        s_wifi_state.disconnect_cleanup_error = err;
    }
    wifi_unlock();
    return err;
}

static esp_err_t wifi_request_disconnect(void)
{
    wifi_lock();
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (s_wifi_wps_ap_helper_identity) { wifi_unlock(); return ESP_ERR_INVALID_STATE; }
#endif
    if (!s_wifi_state.connect_draining && !s_wifi_state.connect_in_progress &&
        !s_wifi_state.status.connected) {
        wifi_unlock();
        return ESP_OK;
    }
    wifi_begin_disconnect_locked();
    bool submit = !s_wifi_state.disconnect_seen &&
        !s_wifi_state.disconnect_submitted && !s_wifi_state.disconnect_active;
    if (submit) s_wifi_state.disconnect_active = true;
    wifi_unlock();
    wifi_stop_connect_timeout_timer();
    xEventGroupClearBits(s_wifi_state.event_group,
                        WIFI_CONNECTED_BIT | WIFI_FAILED_BIT | WIFI_LINK_DRAINED_BIT);
    esp_err_t err = ESP_OK;
    if (submit) {
        err = esp_wifi_disconnect();
        wifi_lock();
        s_wifi_state.disconnect_active = false;
        s_wifi_state.disconnect_submitted = err == ESP_OK || s_wifi_state.disconnect_seen;
        s_wifi_state.disconnect_cleanup_error = s_wifi_state.disconnect_epoch_exhausted
            ? ESP_ERR_INVALID_STATE : err;
        bool drained = wifi_finish_disconnect_locked();
        wifi_unlock();
        if (drained) xEventGroupSetBits(s_wifi_state.event_group, WIFI_LINK_DRAINED_BIT);
    }
    esp_err_t fence_err = wifi_post_disconnect_fence();
    return err != ESP_OK ? err : fence_err;
}

esp_err_t esp32_mquickjs_wifi_cancel_connect(uint32_t generation)
{
    wifi_lock();
    if (generation != s_wifi_state.connect_generation) {
        wifi_unlock();
        return ESP_OK;
    }
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (s_wifi_smartconfig_connect.owner.identity || s_wifi_wps_capture_identity
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
        || s_wifi_wps_ap_helper_identity
#endif
    ) {
        wifi_unlock();
        return ESP_ERR_INVALID_STATE;
    }
#endif
    if (s_wifi_state.connect_in_progress || s_wifi_state.status.connected ||
        s_wifi_state.connect_draining) wifi_begin_disconnect_locked();
    s_wifi_state.connect_future_registered = false;
    s_wifi_state.connection_future_operation = ESP32_MQUICKJS_WIFI_OPERATION_NONE;
    memset(&s_wifi_state.connect_future_token, 0, sizeof(s_wifi_state.connect_future_token));
    wifi_unlock();
    return wifi_request_disconnect();
}

static void wifi_event_handler(void *arg,
                               esp_event_base_t event_base,
                               int32_t event_id,
                               void *event_data)
{
    esp32_mquickjs_wifi_driver_event_t driver_event = {0};

    (void)arg;
    atomic_fetch_add_explicit(&s_wifi_state.callbacks_active, 1,
                              memory_order_acq_rel);
    if (event_base == ESP32QJS_WIFI_CONTROL_EVENT &&
        event_id == WIFI_CONTROL_LINK_DRAINED && event_data != NULL) {
        driver_event.kind = WIFI_DRIVER_EVENT_LINK_DRAINED;
        driver_event.generation = *(const uint32_t *)event_data;
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        driver_event.kind = WIFI_DRIVER_EVENT_STARTED;
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED) {
        const wifi_event_sta_connected_t *event = event_data;
        wifi_lock();
        memset(&s_wifi_state.status.link, 0, sizeof(s_wifi_state.status.link));
        if (!s_wifi_state.connect_draining && event != NULL && event->ssid_len > 0 &&
            event->ssid_len <= sizeof(s_wifi_state.status.link.ssid) &&
            (s_wifi_state.connect_in_progress || s_wifi_state.status.connected)) {
            esp32_mquickjs_wifi_link_snapshot_t *link = &s_wifi_state.status.link;
            memcpy(link->ssid, event->ssid, event->ssid_len);
            link->ssid_len = event->ssid_len;
            memcpy(link->bssid, event->bssid, sizeof(link->bssid));
            link->channel = event->channel;
            link->aid = event->aid;
            link->valid = true;
            wifi_connection_note_association();
        }
        wifi_unlock();
    } else if (event_base == WIFI_EVENT &&
               event_id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *event = event_data;
        driver_event.kind = WIFI_DRIVER_EVENT_DISCONNECTED;
        driver_event.reason =
            event != NULL ? (int32_t)event->reason : 0;
    } else if (event_base == WIFI_EVENT &&
               event_id == WIFI_EVENT_SCAN_DONE) {
        wifi_event_sta_scan_done_t *event = event_data;
        driver_event.kind = WIFI_DRIVER_EVENT_SCAN_DONE;
        driver_event.status = event != NULL ? event->status : 1U;
    } else if (event_base == IP_EVENT &&
               event_id == IP_EVENT_STA_GOT_IP) {
        driver_event.kind = WIFI_DRIVER_EVENT_GOT_IP;
    }
    /* Capture the operation identity before waking its Future: the runtime may
     * finish it and start another operation while this callback is still here. */
    wifi_lock();
    uint32_t observation_generation = event_base != WIFI_EVENT ? 0 :
        event_id == WIFI_EVENT_SCAN_DONE ? s_wifi_state.scan_generation :
        event_id == WIFI_EVENT_STA_DISCONNECTED ? s_wifi_state.connect_generation : 0;
    wifi_unlock();
    if (driver_event.kind != 0) {
        (void)wifi_publish_driver_event_from_callback(&driver_event);
    }
    if (event_base == WIFI_EVENT)
        esp32_mquickjs_wifi_watch_capture(event_id, event_data, observation_generation);
    atomic_fetch_sub_explicit(&s_wifi_state.callbacks_active, 1,
                              memory_order_release);
}

static void wifi_process_driver_event(
    const esp32_mquickjs_wifi_driver_event_t *driver_event)
{
    if (driver_event == NULL) {
        return;
    }
    switch (driver_event->kind) {
    case WIFI_DRIVER_EVENT_STARTED:
        wifi_lock();
        s_wifi_state.started = true;
        s_wifi_state.status.started = true;
        wifi_unlock();
        xEventGroupSetBits(s_wifi_state.event_group, WIFI_STARTED_BIT);
        break;

