99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
    case WIFI_DRIVER_EVENT_DISCONNECTED: {
        wifi_lock();
        bool intentional = s_wifi_state.connect_future_registered &&
            s_wifi_state.connection_future_operation == ESP32_MQUICKJS_WIFI_OPERATION_DISCONNECT;
        bool failed_connect = esp32_mquickjs_wifi_connection_reserved_locked() &&
            s_wifi_state.connection_future_operation == ESP32_MQUICKJS_WIFI_OPERATION_CONNECT &&
            s_wifi_state.connect_in_progress && !s_wifi_state.connect_draining;
        uint32_t generation = s_wifi_state.connect_generation;
        wifi_begin_disconnect_locked();
        s_wifi_state.disconnect_seen = true;
        s_wifi_state.disconnect_submitted = true;
        s_wifi_state.status.last_disconnect_reason = driver_event->reason;
        wifi_unlock();
        wifi_stop_connect_timeout_timer();
        xEventGroupClearBits(s_wifi_state.event_group, WIFI_CONNECTED_BIT);
        (void)wifi_post_disconnect_fence();
        if (intentional || failed_connect) {
            if (failed_connect) xEventGroupSetBits(s_wifi_state.event_group, WIFI_FAILED_BIT);
            wifi_queue_connect_event(generation, intentional
                ? ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_DISCONNECTED
                : ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_FAILURE, driver_event->reason, NULL);
        }
        break;
    }

    case WIFI_DRIVER_EVENT_LINK_DRAINED: {
        wifi_lock();
        bool drained = false;
        if (s_wifi_state.connect_draining && s_wifi_state.disconnect_seen &&
            s_wifi_state.disconnect_fence_posted &&
            driver_event->generation == s_wifi_state.disconnect_epoch) {
            s_wifi_state.disconnect_fence_seen = true;
            drained = wifi_finish_disconnect_locked();
        }
        wifi_unlock();
        if (drained) xEventGroupSetBits(s_wifi_state.event_group, WIFI_LINK_DRAINED_BIT);
        break;
    }

    case WIFI_DRIVER_EVENT_SCAN_DONE: {
        esp32_mquickjs_wifi_scan_event_t scan_event = {0};
        bool should_queue_future;
        esp32_mquickjs_future_token_t scan_token;

        wifi_lock();
        if (!s_wifi_state.scan_in_progress) {
            wifi_unlock();
            break;
        }
        wifi_set_scanning_locked(false);
        s_wifi_state.scan_results_pending = true;
        s_wifi_state.scan_cleanup_error = ESP_OK;
        if (!s_wifi_state.scan_future_registered) s_wifi_state.scan_draining = true;
        scan_event.generation = s_wifi_state.scan_generation;
        scan_event.status = driver_event->status;
        should_queue_future = s_wifi_state.scan_future_registered;
        scan_token = s_wifi_state.scan_future_token;
        wifi_unlock();
        if (should_queue_future && s_wifi_state.scan_queue != NULL) {
            xQueueOverwrite(s_wifi_state.scan_queue, &scan_event);
            esp32_mquickjs_runtime_t *runtime = atomic_load_explicit(&s_wifi_runtime, memory_order_acquire);
            if (runtime != NULL) {
                (void)esp32_mquickjs_future_wake(runtime, scan_token);
                esp32_mquickjs_notify_activity(runtime);
            }
        }
        break;
    }

    case WIFI_DRIVER_EVENT_GOT_IP: {
        bool should_queue_connect_success;
        uint32_t connect_generation;
        esp32_mquickjs_wifi_link_snapshot_t link;

        wifi_lock();
        if (s_wifi_state.connect_draining || !s_wifi_state.connect_in_progress ||
            !esp32_mquickjs_wifi_connection_reserved_locked() ||
            s_wifi_state.connection_future_operation != ESP32_MQUICKJS_WIFI_OPERATION_CONNECT) {
            wifi_unlock();
            break;
        }
        s_wifi_state.status.connected = true;
        s_wifi_state.connect_in_progress = false;
        should_queue_connect_success =
            esp32_mquickjs_wifi_connection_reserved_locked();
        connect_generation = s_wifi_state.connect_generation;
        link = s_wifi_state.status.link;
        s_wifi_state.status.last_disconnect_reason = 0;
        wifi_unlock();
        wifi_stop_connect_timeout_timer();
        xEventGroupClearBits(s_wifi_state.event_group, WIFI_FAILED_BIT);
        xEventGroupSetBits(s_wifi_state.event_group, WIFI_CONNECTED_BIT);
        if (should_queue_connect_success) {
            wifi_queue_connect_event(
                connect_generation,
                ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_SUCCESS, 0, &link);
        }
        break;
    }

    case WIFI_DRIVER_EVENT_CONNECT_TIMEOUT: {
        uint32_t generation = 0;
        bool should_timeout = false;

        wifi_lock();
        if (driver_event->generation == s_wifi_state.connect_generation &&
            esp32_mquickjs_wifi_connection_reserved_locked() &&
            s_wifi_state.connection_future_operation == ESP32_MQUICKJS_WIFI_OPERATION_CONNECT &&
            s_wifi_state.connect_in_progress) {
            generation = s_wifi_state.connect_generation;
            wifi_begin_disconnect_locked();
            should_timeout = true;
        }
        wifi_unlock();
        if (should_timeout) {
            xEventGroupClearBits(
                s_wifi_state.event_group,
                WIFI_CONNECTED_BIT | WIFI_FAILED_BIT);
            (void)wifi_request_disconnect();
            wifi_queue_connect_event(
                generation,
                ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_TIMEOUT, 0, NULL);
        }
        break;
    }

    default:
        break;
    }
}

static bool wifi_driver_event_poller(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime,
                                     void *opaque)
{
    esp32_mquickjs_wifi_driver_event_t event;
    bool handled = false;

    (void)ctx;
    (void)runtime;
    (void)opaque;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
    handled = esp32_mquickjs_wifi_nan_service() || handled;
#endif
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    handled = esp32_mquickjs_wifi_mesh_service() || handled;
    handled = esp32_mquickjs_wifi_mesh_poll_observations(false) || handled;
#endif
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    handled = esp32_mquickjs_wifi_radio_ap_deauth_poll(NULL) || handled;
#endif
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    handled = esp32_mquickjs_wifi_smartconfig_service() || handled;
    handled = esp32_mquickjs_wifi_wps_service() || handled;
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    handled = esp32_mquickjs_wifi_dpp_service() || handled;
    handled = esp32_mquickjs_wifi_dpp_poll_observations(false) || handled;
#endif
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
    handled = esp32_mquickjs_wifi_wps_ap_service() || handled;
#endif
    handled = esp32_mquickjs_wifi_smartconfig_poll_observations(false) || handled;
    handled = esp32_mquickjs_wifi_wps_poll_observations(false) || handled;
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
    handled = esp32_mquickjs_wifi_wps_ap_poll_observations(false) || handled;
#endif
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    handled = esp32_mquickjs_wifi_ftm_service() || handled;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    handled = esp32_mquickjs_wifi_twt_service() || handled;
#endif
#if CONFIG_ESP_WIFI_RRM_SUPPORT
    handled = esp32_mquickjs_wifi_rrm_service() || handled;
    handled = esp32_mquickjs_wifi_rrm_poll_observations(false) || handled;
#endif
    while (s_wifi_state.driver_event_queue != NULL &&
           xQueueReceive(s_wifi_state.driver_event_queue, &event, 0) ==
               pdTRUE) {
        wifi_process_driver_event(&event);
        handled = true;
    }
    uint32_t timeout_generation = atomic_exchange_explicit(
        &s_wifi_timeout_pending, 0, memory_order_acq_rel);
    if (timeout_generation != 0U) {
        event = (esp32_mquickjs_wifi_driver_event_t){
            .kind = WIFI_DRIVER_EVENT_CONNECT_TIMEOUT,
            .generation = timeout_generation,
        };
        wifi_process_driver_event(&event);
        handled = true;
    }
    wifi_lock();
    bool drain_scan = s_wifi_state.scan_draining &&
        s_wifi_state.scan_cleanup_error == ESP_OK;
    wifi_unlock();
    if (drain_scan) (void)esp32_mquickjs_wifi_drain_scan();
    wifi_release_radio_operation();
    return handled;
}

/* Native identities are boot-scoped even after all helper allocations exit. */
static void wifi_reset_helper_state(void)
{
    uint32_t scan_generation = s_wifi_state.scan_generation;
    uint32_t connect_generation = s_wifi_state.connect_generation;
    uint32_t disconnect_epoch = s_wifi_state.disconnect_epoch;
    bool exhausted = s_wifi_state.disconnect_epoch_exhausted;
    memset(&s_wifi_state, 0, sizeof(s_wifi_state));
    s_wifi_state.scan_generation = scan_generation;
    s_wifi_state.connect_generation = connect_generation;
    s_wifi_state.disconnect_epoch = disconnect_epoch;
    s_wifi_state.disconnect_epoch_exhausted = exhausted;
}

static esp_err_t wifi_prepare_station_netif(void)
{
    if (s_wifi_state.sta_netif != NULL || s_wifi_state.sta_detach_error != ESP_OK)
        return ESP_ERR_INVALID_STATE;
    s_wifi_setup_stage = "netif-create";
    esp_netif_config_t config = ESP_NETIF_DEFAULT_WIFI_STA();
    s_wifi_state.sta_netif = esp_netif_new(&config);
    if (s_wifi_state.sta_netif == NULL) return ESP_ERR_NO_MEM;
    s_wifi_setup_stage = "netif-attach";
    esp_err_t err = esp_netif_attach_wifi_station(s_wifi_state.sta_netif);
    if (err != ESP_OK) return err;
    s_wifi_setup_stage = "netif-handlers";
    return esp_wifi_set_default_wifi_sta_handlers();
}

static esp_err_t wifi_start_existing_station_netif(void)
{
    esp_netif_t *netif = s_wifi_state.sta_netif;
    if (netif == NULL) return ESP_ERR_INVALID_ARG;
    /* Radio's START fence has completed and our STA lease prevents STOP.
     * If START reached the newly attached default handler, netif_add already
     * installed input. Adding the same lwIP netif twice corrupts its list. */
    struct netif *stack = esp_netif_get_netif_impl(netif);
    if (stack != NULL && stack->input != NULL) return ESP_OK;

    /* Monitor/Raw TX/ESP-NOW can start STA before an IP interface exists.
     * Replay only the SDK Station start work, without posting a synthetic
     * Wi-Fi event or changing the shared Radio. RX attaches on CONNECTED. */
    uint8_t mac[6];
    s_wifi_setup_stage = "netif-start-mac";
    esp_err_t err = esp_wifi_get_mac(WIFI_IF_STA, mac);
    if (err != ESP_OK) return err;
    s_wifi_setup_stage = "netif-start-buffer-callbacks";
    err = esp_wifi_internal_reg_netstack_buf_cb(
        esp_netif_netstack_buf_ref, esp_netif_netstack_buf_free);
    if (err != ESP_OK) return err;
    s_wifi_setup_stage = "netif-start-set-mac";
    err = esp_netif_set_mac(netif, mac);
    if (err != ESP_OK) return err;
    s_wifi_setup_stage = "netif-start-stack";
    return esp_netif_start(netif);
}

static esp_err_t wifi_retire_station_netif(void)
{
    return esp32_mquickjs_wifi_netif_retire(&s_wifi_state.sta_netif,
                                          &s_wifi_state.sta_detach_error);
}

static esp_err_t wifi_cleanup_helper(bool finish_lifecycle)
{
    esp32_mquickjs_wifi_runtime_resources_t resources;
    esp_err_t err;

    /* The lock is created first and released last. A failed suffix keeps all
     * callback-visible storage and the exact remaining native handles alive. */
    if (s_wifi_state.sta_detach_error != ESP_OK) {
        s_wifi_state.cleanup_stage = "netif-detach";
        err = s_wifi_state.sta_detach_error;
        goto pending;
    }
    if (s_wifi_state.lock == NULL) goto finish_radio;

    if (s_wifi_state.connect_timeout_timer != NULL) {
        if (!s_wifi_state.cleanup_timer_stopped) {
            s_wifi_state.cleanup_stage = "timer-stop";
            err = esp_timer_stop_blocking(s_wifi_state.connect_timeout_timer,
                                         esp32_mquickjs_wifi_wait_remaining(pdMS_TO_TICKS(1000)));
            if (err != ESP_OK) goto pending;
            s_wifi_state.cleanup_timer_stopped = true;
        }
        s_wifi_state.cleanup_stage = "timer-delete";
        err = esp_timer_delete(s_wifi_state.connect_timeout_timer);
        if (err != ESP_OK) goto pending;
        s_wifi_state.connect_timeout_timer = NULL;
    }
    if (s_wifi_state.control_event_instance != NULL) {
        s_wifi_state.cleanup_stage = "control-unregister";
        err = esp_event_handler_instance_unregister(
            ESP32QJS_WIFI_CONTROL_EVENT, WIFI_CONTROL_LINK_DRAINED,
            s_wifi_state.control_event_instance);
        if (err != ESP_OK) goto pending;
        s_wifi_state.control_event_instance = NULL;
    }
    if (s_wifi_state.ip_event_instance != NULL) {
        s_wifi_state.cleanup_stage = "ip-unregister";
        err = esp_event_handler_instance_unregister(
            IP_EVENT, IP_EVENT_STA_GOT_IP,
            s_wifi_state.ip_event_instance);
        if (err != ESP_OK) goto pending;
        s_wifi_state.ip_event_instance = NULL;
    }
    if (s_wifi_state.wifi_scan_event_instance != NULL) {
        s_wifi_state.cleanup_stage = "scan-unregister";
        err = esp_event_handler_instance_unregister(
            WIFI_EVENT, WIFI_EVENT_SCAN_DONE,
            s_wifi_state.wifi_scan_event_instance);
        if (err != ESP_OK) goto pending;
        s_wifi_state.wifi_scan_event_instance = NULL;
    }
    if (s_wifi_state.wifi_disconnect_event_instance != NULL) {
        s_wifi_state.cleanup_stage = "disconnect-unregister";
        err = esp_event_handler_instance_unregister(
            WIFI_EVENT, WIFI_EVENT_STA_DISCONNECTED,
            s_wifi_state.wifi_disconnect_event_instance);
        if (err != ESP_OK) goto pending;
        s_wifi_state.wifi_disconnect_event_instance = NULL;
    }
    if (s_wifi_state.wifi_connected_event_instance != NULL) {
        s_wifi_state.cleanup_stage = "connected-unregister";
        err = esp_event_handler_instance_unregister(WIFI_EVENT, WIFI_EVENT_STA_CONNECTED,
            s_wifi_state.wifi_connected_event_instance);
        if (err != ESP_OK) goto pending;
        s_wifi_state.wifi_connected_event_instance = NULL;
    }
    if (s_wifi_state.wifi_start_event_instance != NULL) {
        s_wifi_state.cleanup_stage = "start-unregister";
        err = esp_event_handler_instance_unregister(
            WIFI_EVENT, WIFI_EVENT_STA_START,
            s_wifi_state.wifi_start_event_instance);
        if (err != ESP_OK) goto pending;
        s_wifi_state.wifi_start_event_instance = NULL;
    }
    while (atomic_load_explicit(&s_wifi_state.callbacks_active,
                                memory_order_acquire) != 0U) {
        s_wifi_state.cleanup_stage = "callbacks-drain";
        if (esp32_mquickjs_wifi_wait_remaining(portMAX_DELAY) == 0) {
            err = ESP_ERR_TIMEOUT;
            goto pending;
        }
        vTaskDelay(1);
    }
    atomic_store_explicit(&s_wifi_watch_control_mask, 0, memory_order_release);
    if (!s_wifi_state.cleanup_radio_released) {
        s_wifi_state.cleanup_stage = "radio-release";
        err = esp32_mquickjs_wifi_radio_release_and_stop_idle(&s_wifi_state.radio_lease);
        if (err != ESP_OK) goto pending;
        s_wifi_state.cleanup_radio_released = true;
    }
    if (finish_lifecycle && s_wifi_lifecycle.identity != 0U) {
        s_wifi_state.cleanup_stage = "radio-stop";
        err = esp32_mquickjs_wifi_radio_quiesce_lifecycle(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
    }
    s_wifi_state.cleanup_stage = "netif-detach";
    err = wifi_retire_station_netif();
    if (err != ESP_OK) goto pending;
    resources = (esp32_mquickjs_wifi_runtime_resources_t){
        .lock = s_wifi_state.lock,
        .event_group = s_wifi_state.event_group,
        .scan_queue = s_wifi_state.scan_queue,
        .connect_queue = s_wifi_state.connect_queue,
        .driver_event_queue = s_wifi_state.driver_event_queue,
    };
    esp32_mquickjs_wifi_runtime_resources_deinit(
        &resources, &s_wifi_runtime_resource_ops);
    wifi_reset_helper_state();
finish_radio:
    if (finish_lifecycle && s_wifi_lifecycle.identity != 0U) {
        s_wifi_state.cleanup_stage = "radio-stop";
        err = esp32_mquickjs_wifi_radio_finish_lifecycle(&s_wifi_lifecycle, false);
        if (err != ESP_OK) goto pending;
        s_wifi_state.cleanup_stage = NULL;
        s_wifi_state.cleanup_error = ESP_OK;
    }
    s_wifi_state.runtime_cleanup_pending = false;
    return ESP_OK;

pending:
    s_wifi_state.cleanup_error = err;
    ESP_LOGE(TAG, "Wi-Fi cleanup pending at %s: %s",
             s_wifi_state.cleanup_stage, esp_err_to_name(err));
    return err;
}

static esp_err_t wifi_cleanup_failed_init(void)
{
    return wifi_cleanup_helper(true);
}

static esp_err_t wifi_init_helper(bool acquire_lease)
{
    esp32_mquickjs_wifi_runtime_resources_t resources = {0};
    esp32_mquickjs_wifi_radio_status_t radio_status;
    esp_err_t err;

    if (s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL) {
        return s_wifi_state.cleanup_error != ESP_OK
            ? s_wifi_state.cleanup_error : ESP_ERR_INVALID_STATE;
    }
    if (s_wifi_state.initialized) {
        return ESP_OK;
    }

    s_wifi_setup_stage = "runtime-resources";
    s_wifi_setup_error = ESP_OK;
    wifi_reset_helper_state();
    atomic_init(&s_wifi_state.callbacks_active, 0);
    atomic_init(&s_wifi_state.dropped_driver_events, 0);
    atomic_store(&s_wifi_timeout_pending, 0);
    atomic_store(&s_wifi_timeout_armed_generation, 0);
    if (!esp32_mquickjs_wifi_runtime_resources_init(
            &resources, &s_wifi_runtime_resource_ops,
            WIFI_SCAN_EVENT_QUEUE_LEN,
            sizeof(esp32_mquickjs_wifi_scan_event_t),
            WIFI_CONNECT_EVENT_QUEUE_LEN,
            sizeof(esp32_mquickjs_wifi_connect_event_t),
            WIFI_DRIVER_EVENT_QUEUE_LEN,
            sizeof(esp32_mquickjs_wifi_driver_event_t))) {
        s_wifi_setup_error = ESP_ERR_NO_MEM;
        return ESP_ERR_NO_MEM;
    }
    s_wifi_state.lock = resources.lock;
    s_wifi_state.event_group = resources.event_group;
    s_wifi_state.scan_queue = resources.scan_queue;
    s_wifi_state.connect_queue = resources.connect_queue;
    s_wifi_state.driver_event_queue = resources.driver_event_queue;

    if (acquire_lease) {
        s_wifi_setup_stage = "radio-acquire";
        err = esp32_mquickjs_wifi_radio_acquire(
            ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
            WIFI_MODE_STA, &s_wifi_state.radio_lease);
        if (err != ESP_OK) goto fail;
    }
    s_wifi_setup_stage = "net-init";
    err = esp32_mquickjs_net_ensure_initialized();
    if (err != ESP_OK) goto fail;
    err = wifi_prepare_station_netif();
    if (err != ESP_OK) goto fail;
    s_wifi_setup_stage = "event-handlers";

    atomic_fetch_or_explicit(&s_wifi_watch_control_mask, 1U << WIFI_EVENT_STA_START, memory_order_release);
    err = esp_event_handler_instance_register(
        WIFI_EVENT, WIFI_EVENT_STA_START, wifi_event_handler, NULL,
        &s_wifi_state.wifi_start_event_instance);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "register WIFI_EVENT start handler failed: %s",
                 esp_err_to_name(err));
        goto fail;
    }
    atomic_fetch_or_explicit(&s_wifi_watch_control_mask, 1U << WIFI_EVENT_STA_CONNECTED, memory_order_release);
    err = esp_event_handler_instance_register(WIFI_EVENT, WIFI_EVENT_STA_CONNECTED,
        wifi_event_handler, NULL, &s_wifi_state.wifi_connected_event_instance);
    if (err != ESP_OK) goto fail;
    atomic_fetch_or_explicit(&s_wifi_watch_control_mask, 1U << WIFI_EVENT_STA_DISCONNECTED, memory_order_release);
    err = esp_event_handler_instance_register(
        WIFI_EVENT, WIFI_EVENT_STA_DISCONNECTED, wifi_event_handler, NULL,
        &s_wifi_state.wifi_disconnect_event_instance);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "register WIFI_EVENT disconnect handler failed: %s",
                 esp_err_to_name(err));
        goto fail;
    }
    atomic_fetch_or_explicit(&s_wifi_watch_control_mask, 1U << WIFI_EVENT_SCAN_DONE, memory_order_release);
    err = esp_event_handler_instance_register(
        WIFI_EVENT, WIFI_EVENT_SCAN_DONE, wifi_event_handler, NULL,
        &s_wifi_state.wifi_scan_event_instance);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "register WIFI_EVENT scan handler failed: %s",
                 esp_err_to_name(err));
        goto fail;
    }
    err = esp_event_handler_instance_register(
        IP_EVENT, IP_EVENT_STA_GOT_IP, wifi_event_handler, NULL,
        &s_wifi_state.ip_event_instance);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "register IP_EVENT handler failed: %s",
                 esp_err_to_name(err));
        goto fail;
    }
    err = esp_event_handler_instance_register(
        ESP32QJS_WIFI_CONTROL_EVENT, WIFI_CONTROL_LINK_DRAINED,
        wifi_event_handler, NULL, &s_wifi_state.control_event_instance);
    if (err != ESP_OK) goto fail;
    {
        esp_timer_create_args_t timer_args = {
            .callback = wifi_connect_timeout_cb,
            .name = "wifi_connect_timeout",
        };
        s_wifi_setup_stage = "timer-create";
        err = esp_timer_create(
            &timer_args, &s_wifi_state.connect_timeout_timer);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "create Wi-Fi connect timeout timer failed: %s",
                     esp_err_to_name(err));
            goto fail;
        }
    }

    wifi_lock();
    s_wifi_state.initialized = true;
    s_wifi_state.status.initialized = true;
    s_wifi_state.status.started = false;
    s_wifi_state.status.connected = false;
    s_wifi_state.status.scanning = false;
    s_wifi_state.status.last_disconnect_reason = 0;
    wifi_unlock();

