99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
    if (esp32_mquickjs_wifi_radio_get_status(&radio_status) == ESP_OK &&
        radio_status.started && (radio_status.mode & WIFI_MODE_STA) != 0) {
        /* A concurrent owner may still be waiting for the real START event.
         * Join that serialized fence before inspecting/starting its netif.
         * Configuration-only helpers are created under a stopped lifecycle. */
        s_wifi_setup_stage = "netif-start-radio-fence";
        err = esp32_mquickjs_wifi_radio_ensure_started(&s_wifi_state.radio_lease);
        if (err != ESP_OK) goto fail;
        err = wifi_start_existing_station_netif();
        if (err != ESP_OK) goto fail;
        wifi_lock();
        s_wifi_state.started = true;
        s_wifi_state.status.started = true;
        wifi_unlock();
        xEventGroupSetBits(s_wifi_state.event_group, WIFI_STARTED_BIT);
    }

    s_wifi_setup_stage = NULL;
    s_wifi_setup_error = ESP_OK;
    return ESP_OK;

fail:
    s_wifi_setup_error = err;
    (void)wifi_cleanup_helper(acquire_lease);
    return err;
}

static esp_err_t wifi_init_once(void)
{
    return wifi_init_helper(true);
}

static bool wifi_helpers_idle(bool allow_connected)
{
    wifi_lock();
    bool busy = (!allow_connected && s_wifi_state.status.connected) || s_wifi_state.connect_in_progress ||
        s_wifi_state.connect_draining || s_wifi_state.connect_start_active ||
        s_wifi_state.disconnect_active || s_wifi_state.scan_in_progress ||
        s_wifi_state.scan_draining || s_wifi_state.scan_results_pending ||
        s_wifi_state.scan_start_active || s_wifi_state.scan_stop_active ||
        esp32_mquickjs_wifi_connection_reserved_locked() || s_wifi_state.scan_future_registered;
    wifi_unlock();
    return !busy;
}

bool esp32_mquickjs_wifi_raw_tx_ap_ready(void)
{
    return !s_wifi_configuration_cleanup && !s_wifi_ap_stop_cleanup && s_wifi_lifecycle.identity == 0U &&
        !s_wifi_state.runtime_cleanup_pending && s_wifi_state.cleanup_stage == NULL && wifi_helpers_idle(false);
}

esp_err_t esp32_mquickjs_wifi_prepare_for_configuration(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp_err_t err = esp32_mquickjs_wifi_radio_check_stopped_lifecycle(token, false);
    if (err != ESP_OK) return err;
    if (s_wifi_state.radio_lease.acquired || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    err = wifi_init_helper(false);
    if (err != ESP_OK) return err;
    wifi_lock();
    s_wifi_state.started = false;
    s_wifi_state.status.started = false;
    wifi_unlock();
    xEventGroupClearBits(s_wifi_state.event_group, WIFI_STARTED_BIT);
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_retire_for_configuration(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp_err_t err = esp32_mquickjs_wifi_radio_check_stopped_lifecycle(token, true);
    if (err != ESP_OK) return err;
    if (s_wifi_state.radio_lease.acquired || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    return wifi_cleanup_helper(false);
}

esp_err_t esp32_mquickjs_wifi_retire_for_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp_err_t err = esp32_mquickjs_wifi_radio_check_stopped_recovery(token);
    if (err != ESP_OK) return err;
    if (s_wifi_state.radio_lease.acquired || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    return wifi_cleanup_helper(false);
}

static EventBits_t wifi_wait_for_bits(EventBits_t bits_to_wait_for,
                                      bool clear_on_exit,
                                      uint32_t timeout_ms,
                                      bool *out_interrupted)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_native_wait_t wait;
    uint32_t remaining_ms = timeout_ms;
    EventBits_t result = 0;

    if (out_interrupted != NULL) {
        *out_interrupted = false;
    }
    esp32_mquickjs_native_wait_begin(runtime, &wait);
    for (;;) {
        uint32_t slice_ms = remaining_ms > ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS
                                ? ESP32_MQUICKJS_COOPERATIVE_WAIT_SLICE_MS
                                : remaining_ms;
        TickType_t wait_ticks = pdMS_TO_TICKS(slice_ms);
        EventBits_t bits;

        if (!esp32_mquickjs_cooperate(runtime)) {
            if (out_interrupted != NULL) {
                *out_interrupted = true;
            }
            break;
        }
        if (slice_ms > 0 && wait_ticks == 0) {
            wait_ticks = 1;
        }
        (void)wifi_driver_event_poller(NULL, runtime, NULL);
        bits = xEventGroupWaitBits(s_wifi_state.event_group,
                                   bits_to_wait_for,
                                   clear_on_exit ? pdTRUE : pdFALSE,
                                   pdFALSE,
                                   wait_ticks);
        (void)wifi_driver_event_poller(NULL, runtime, NULL);
        bits |= xEventGroupGetBits(s_wifi_state.event_group);
        if (!esp32_mquickjs_cooperate(runtime)) {
            if (out_interrupted != NULL) {
                *out_interrupted = true;
            }
            break;
        }
        if ((bits & bits_to_wait_for) != 0 || remaining_ms <= slice_ms) {
            result = bits;
            break;
        }
        remaining_ms -= slice_ms;
    }
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return result;
}

esp_err_t esp32_mquickjs_wifi_ensure_started(void)
{
    esp32_mquickjs_wifi_radio_status_t radio_status;
    ESP_RETURN_ON_ERROR(wifi_init_once(), TAG, "wifi_init_once() failed");
    /* A cached STA_START bit must not bypass exact lease/fault validation.
     * Radio now waits for native START and its default-loop marker itself. */
    ESP_RETURN_ON_ERROR(esp32_mquickjs_wifi_radio_ensure_started(&s_wifi_state.radio_lease),
                        TAG, "start Wi-Fi radio failed");
    ESP_RETURN_ON_ERROR(esp32_mquickjs_wifi_radio_get_status(&radio_status),
                        TAG, "read Wi-Fi radio status failed");
    if (!radio_status.started || (radio_status.mode & WIFI_MODE_STA) == 0)
        return ESP_ERR_INVALID_STATE;
    wifi_lock();
    s_wifi_state.started = true;
    s_wifi_state.status.started = true;
    wifi_unlock();
    xEventGroupSetBits(s_wifi_state.event_group, WIFI_STARTED_BIT);
    return ESP_OK;
}

static const char *wifi_authmode_to_string(wifi_auth_mode_t authmode)
{
    switch (authmode) {
    case WIFI_AUTH_OPEN:
        return "open";
    case WIFI_AUTH_WEP:
        return "wep";
    case WIFI_AUTH_WPA_PSK:
        return "wpa";
    case WIFI_AUTH_WPA2_PSK:
        return "wpa2";
    case WIFI_AUTH_WPA_WPA2_PSK:
        return "wpa/wpa2";
    case WIFI_AUTH_WPA2_ENTERPRISE:
        return "wpa2-enterprise";
    case WIFI_AUTH_WPA3_PSK:
        return "wpa3";
    case WIFI_AUTH_WPA2_WPA3_PSK:
        return "wpa2/wpa3";
    case WIFI_AUTH_WAPI_PSK:
        return "wapi";
    case WIFI_AUTH_OWE:
        return "owe";
    case WIFI_AUTH_WPA3_ENT_192:
        return "wpa3-ent-192";
    default:
        return "unknown";
    }
}

static const char *wifi_reason_to_string(int32_t reason)
{
    switch (reason) {
    case 0:
        return "none";
    case WIFI_REASON_BEACON_TIMEOUT:
        return "beacon-timeout";
    case WIFI_REASON_NO_AP_FOUND:
        return "no-ap-found";
    case WIFI_REASON_AUTH_FAIL:
        return "auth-fail";
    case WIFI_REASON_ASSOC_FAIL:
        return "assoc-fail";
    case WIFI_REASON_HANDSHAKE_TIMEOUT:
        return "handshake-timeout";
    case WIFI_REASON_CONNECTION_FAIL:
        return "connection-fail";
    case WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY:
        return "no-ap-compatible-security";
    case WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD:
        return "no-ap-authmode-threshold";
    case WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD:
        return "no-ap-rssi-threshold";
    default:
        return "unknown";
    }
}

const char *esp32_mquickjs_wifi_reason_to_string(int32_t reason)
{
    return wifi_reason_to_string(reason);
}

static const char *wifi_radio_mode_to_string(wifi_mode_t mode)
{
    switch (mode) {
    case WIFI_MODE_STA:
        return "station";
    case WIFI_MODE_AP:
        return "softAP";
    case WIFI_MODE_APSTA:
        return "station+softAP";
    case WIFI_MODE_NAN:
        return "nan";
    case WIFI_MODE_NULL:
    default:
        return "off";
    }
}

static const char *wifi_power_save_to_string(wifi_ps_type_t mode)
{
    switch (mode) {
    case WIFI_PS_NONE:
        return "none";
    case WIFI_PS_MIN_MODEM:
        return "minimum";
    case WIFI_PS_MAX_MODEM:
        return "maximum";
    default:
        return NULL;
    }
}

static const char *wifi_negotiated_phy_name(wifi_phy_mode_t phy)
{
    switch (phy) {
    case WIFI_PHY_MODE_LR: return "lr";
    case WIFI_PHY_MODE_11B: return "11b";
    case WIFI_PHY_MODE_11G: return "11g";
    case WIFI_PHY_MODE_11A: return "11a";
    case WIFI_PHY_MODE_HT20: return "ht20";
    case WIFI_PHY_MODE_HT40: return "ht40";
    case WIFI_PHY_MODE_HE20: return "he20";
    case WIFI_PHY_MODE_VHT20: return "vht20";
    default: return NULL;
    }
}

