99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
static bool wifi_link_snapshot_valid(const esp32_mquickjs_wifi_link_snapshot_t *link)
{
    static const uint8_t zero_mac[6] = {0};
    return link != NULL && link->valid && link->ssid_len > 0 &&
        link->ssid_len <= sizeof(link->ssid) && link->channel != 0 &&
        (link->bssid[0] & 1U) == 0 && memcmp(link->bssid, zero_mac, 6) != 0;
}

/* obj is a movable-GC root. Native identity belongs to the caller's value
 * snapshot; the optional RF samples are taken now and can be unavailable. */
static bool wifi_set_link_properties(JSContext *ctx, JSValue *obj,
    const esp32_mquickjs_wifi_link_snapshot_t *link)
{
    bool valid = wifi_link_snapshot_valid(link);
    esp32_mquickjs_wifi_link_sample_t sample = {0};
    char bssid[18];
    if (valid) {
        snprintf(bssid, sizeof(bssid), "%02x:%02x:%02x:%02x:%02x:%02x",
            link->bssid[0], link->bssid[1], link->bssid[2],
            link->bssid[3], link->bssid[4], link->bssid[5]);
        (void)esp32_mquickjs_wifi_radio_sample_station_link(
            &s_wifi_state.radio_lease, link->bssid, link->channel, &sample);
    }
    const char *phy = sample.phy_valid ? wifi_negotiated_phy_name(sample.phy) : NULL;
    return esp32_mquickjs_set_property_ref(ctx, obj, "bssid",
            valid ? JS_NewString(ctx, bssid) : JS_NULL) &&
        esp32_mquickjs_set_property_ref(ctx, obj, "channel",
            valid ? JS_NewUint32(ctx, link->channel) : JS_NULL) &&
        esp32_mquickjs_set_property_ref(ctx, obj, "aid",
            valid && link->aid != 0 ? JS_NewUint32(ctx, link->aid) : JS_NULL) &&
        esp32_mquickjs_set_property_ref(ctx, obj, "rssi",
            sample.rssi_valid ? JS_NewInt32(ctx, sample.rssi) : JS_NULL) &&
        esp32_mquickjs_set_property_ref(ctx, obj, "negotiatedPhy",
            phy != NULL ? JS_NewString(ctx, phy) : JS_NULL);
}

JSValue esp32_mquickjs_wifi_make_connect_result(JSContext *ctx,
    const esp32_mquickjs_wifi_link_snapshot_t *link, double elapsed_ms)
{
    if (!wifi_link_snapshot_valid(link)) {
        return esp32_mquickjs_wifi_throw_operation_error(ctx,
            "WIFI_CONNECT_FAILED", "wifi.connect", ESP_ERR_INVALID_RESPONSE,
            -1, UINT32_MAX);
    }
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "connected", JS_TRUE) ||
        !esp32_mquickjs_wifi_set_ssid_properties(ctx, result, link->ssid, link->ssid_len) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "elapsedMs", JS_NewFloat64(ctx, elapsed_ms)) ||
        !wifi_set_link_properties(ctx, result, link)) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue wifi_make_configuration_status(JSContext *ctx,
    const esp32_mquickjs_wifi_radio_config_result_t *configuration)
{
    if (configuration->stage == NULL) return JS_NULL;
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "stage", JS_NewString(ctx, configuration->stage)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "error", JS_NewInt32(ctx, configuration->error)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "mutationAttempted", JS_NewBool(configuration->mutation_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rollbackAttempted", JS_NewBool(configuration->rollback_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rollbackComplete", JS_NewBool(configuration->rollback_complete)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rollbackStage",
            configuration->rollback_stage != NULL ? JS_NewString(ctx, configuration->rollback_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rollbackError", JS_NewInt32(ctx, configuration->rollback_error)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "persistentMutationPossible",
            JS_NewBool(configuration->persistent_mutation_possible))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

/* Shared by wifi.status().radio and wifi.driver.status(). Native Radio fields
 * are captured together. Module diagnostics are separate observations and do
 * not reserve admission for a later mutation. No Station/netif initialization. */
static JSValue wifi_make_radio_status(JSContext *ctx,
    const esp32_mquickjs_wifi_radio_status_t *snapshot)
{
    const esp32_mquickjs_wifi_radio_status_t radio_status = *snapshot;
    JSGCRef radio_ref, clients_ref;
    JSValue *radio_obj = JS_PushGCRef(ctx, &radio_ref);
    JSValue *clients_obj = JS_PushGCRef(ctx, &clients_ref);
    uint32_t client_total = 0;
    *radio_obj = JS_NewObject(ctx);
    *clients_obj = JS_NewObject(ctx);
    if (JS_IsException(*radio_obj) || JS_IsException(*clients_obj)) goto fail;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RADIO_CLIENT_COUNT; ++i)
        client_total += radio_status.clients[i];
    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "configuration",
            wifi_make_configuration_status(ctx, &radio_status.configuration))) goto fail;
    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "activation",
            wifi_make_configuration_status(ctx, &radio_status.activation))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "channelObservationError",
            radio_status.channel_observation_error != ESP_OK
                ? JS_NewInt32(ctx, radio_status.channel_observation_error) : JS_NULL)) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "lifecycleActive",
            JS_NewBool(radio_status.lifecycle_active))) goto fail;
    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventPhase",
            JS_NewString(ctx, radio_status.event_phase == 1 ? "start" :
                radio_status.event_phase == 2 ? "stop" : radio_status.event_phase == 3 ? "ap-stop" : radio_status.event_phase == 4 ? "ap-start" : radio_status.event_phase == 5 ? "restart" : radio_status.event_phase == 6 ? "sta-start" : "idle")) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventIdentity", JS_NewUint32(ctx, radio_status.event_identity)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventExpectedMask", JS_NewUint32(ctx, radio_status.event_expected)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventSeenMask", JS_NewUint32(ctx, radio_status.event_seen)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventStoppedMask", JS_NewUint32(ctx, radio_status.event_stopped)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventLiveMask", JS_NewUint32(ctx, radio_status.event_live)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "eventFencePending", JS_NewBool(radio_status.event_fence_pending))) goto fail;


