99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "activeOperations",
            JS_NewUint32(ctx, radio_status.active_operations))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "action",
            esp32_mquickjs_wifi_action_status(ctx))) goto fail;
    if (!esp32_mquickjs_set_property_ref(ctx, radio_obj, "rawTx",
            esp32_mquickjs_wifi_raw_tx_status(ctx))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiAccessPoint",
            JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP]))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "application",
            JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION]))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiMonitor",
            JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_MONITOR]))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiRawTx",
            JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX]))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiAction",
            JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ACTION]))) goto fail;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiNan",
        JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_NAN]))) goto fail;
#endif
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiMesh",
        JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_MESH]))) goto fail;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiTwt",
        JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT]))) goto fail;
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiFtm",
        JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_FTM]))) goto fail;
#endif
    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "wifiVendorIe",
            JS_NewUint32(ctx, radio_status.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE]))) goto fail;

    if (!esp32_mquickjs_set_property_ref(ctx, clients_obj, "total",
                                         JS_NewUint32(ctx, client_total)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, clients_obj, "wifiStation",
            JS_NewUint32(
                ctx, radio_status.clients[
                         ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA])) ||
        !esp32_mquickjs_set_property_ref(
            ctx, clients_obj, "espNow",
            JS_NewUint32(
                ctx, radio_status.clients[
                         ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ESPNOW])) ||
        !esp32_mquickjs_set_property_ref(
            ctx, clients_obj, "wifiCsi",
            JS_NewUint32(
                ctx, radio_status.clients[
                         ESP32_MQUICKJS_WIFI_RADIO_CLIENT_CSI])) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "generation",
                                         JS_NewUint32(
                                             ctx, radio_status.generation)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "initialized",
                                         JS_NewBool(
                                             radio_status.initialized)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "driverState",
            JS_NewString(ctx, esp32_mquickjs_wifi_radio_driver_state_name(radio_status.driver_state))) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "requestedMode",
            JS_NewString(ctx, wifi_radio_mode_to_string(radio_status.requested_mode))) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "fixedChannelOwners",
            JS_NewUint32(ctx, radio_status.fixed_channel_owners)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "promiscuousOwners",
            JS_NewUint32(ctx, radio_status.promiscuous_owners)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "promiscuousIdentityExhausted",
            JS_NewBool(radio_status.promiscuous_identity_exhausted)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "wakeLocks",
            JS_NewUint32(ctx, radio_status.wake_locks)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "wakeLockError",
            radio_status.wake_lock_error != ESP_OK ? JS_NewInt32(ctx, radio_status.wake_lock_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "conflictedChannelOwners",
            JS_NewUint32(ctx, radio_status.conflicted_channel_owners)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "cleanupStage",
            radio_status.cleanup_stage != NULL ? JS_NewString(ctx, radio_status.cleanup_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "cleanupError",
            radio_status.cleanup_stage != NULL ? JS_NewInt32(ctx, radio_status.cleanup_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "driverOwned",
                                         JS_NewBool(radio_status.driver_owned)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "restartSnapshotBytes",
            JS_NewUint32(ctx, esp32_mquickjs_wifi_radio_restart_snapshot_bytes())) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "policies",
            esp32_mquickjs_wifi_policies_to_js(ctx)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "rssiThreshold",
            esp32_mquickjs_wifi_rssi_request_to_js(ctx)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "connectionlessInterval",
            esp32_mquickjs_wifi_interval_to_js(ctx)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "restartRequired",
                                         JS_NewBool(radio_status.restart_required)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "faultStage",
            radio_status.fault_stage != NULL
                ? JS_NewString(ctx, radio_status.fault_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "faultError",
            radio_status.fault_stage != NULL
                ? JS_NewInt32(ctx, radio_status.fault_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "starting",
                                         JS_NewBool(radio_status.starting)) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "started",
                                         JS_NewBool(radio_status.started)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, radio_obj, "mode",
            JS_NewString(ctx, wifi_radio_mode_to_string(radio_status.mode))) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "storage",
            radio_status.initialized ? JS_NewString(ctx, radio_status.storage == WIFI_STORAGE_RAM ? "ram" : "flash") : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, radio_obj, "channel",
            radio_status.primary_channel > 0
                ? JS_NewUint32(ctx, radio_status.primary_channel)
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, radio_obj, "channelGeneration",
            JS_NewUint32(ctx, radio_status.channel_generation)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, radio_obj, "maxTxPowerDbm",
            radio_status.max_tx_power_available
                ? JS_NewFloat64(
                      ctx,
                      (double)radio_status.max_tx_power_quarter_dbm / 4.0)
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, radio_obj, "powerSave",
            radio_status.power_save_available &&
                    wifi_power_save_to_string(radio_status.power_save) != NULL
                ? JS_NewString(
                      ctx, wifi_power_save_to_string(radio_status.power_save))
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, radio_obj, "clients",
                                         *clients_obj)) goto fail;
    JS_PopGCRef(ctx, &clients_ref);
    return JS_PopGCRef(ctx, &radio_ref);
fail:
    JS_PopGCRef(ctx, &clients_ref);
    JS_PopGCRef(ctx, &radio_ref);
    return JS_EXCEPTION;
}

