99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
JSValue js_wifi_driver_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.driver.status() takes no arguments");
    esp32_mquickjs_wifi_radio_status_t snapshot;
    if (esp32_mquickjs_wifi_radio_get_status(&snapshot) != ESP_OK)
        return JS_ThrowInternalError(ctx, "failed to read Wi-Fi Radio status");
    return wifi_make_radio_status(ctx, &snapshot);
}

static JSValue wifi_make_status_object(JSContext *ctx)
{
    esp32_mquickjs_wifi_status_t status;
    esp32_mquickjs_wifi_radio_status_t radio_status;
    JSGCRef status_ref, radio_ref;
    JSValue *status_obj = JS_PushGCRef(ctx, &status_ref);
    JSValue *radio_obj = JS_PushGCRef(ctx, &radio_ref);

    *status_obj = JS_UNDEFINED;
    *radio_obj = JS_UNDEFINED;
    if (esp32_mquickjs_wifi_get_status(&status) != ESP_OK ||
        esp32_mquickjs_wifi_radio_get_status(&radio_status) != ESP_OK) {
        JS_ThrowInternalError(ctx, "failed to read Wi-Fi status");
        goto fail;
    }

    *status_obj = JS_NewObject(ctx);
    *radio_obj = wifi_make_radio_status(ctx, &radio_status);
    if (JS_IsException(*status_obj) || JS_IsException(*radio_obj)) {
        goto fail;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, status_obj, "setupStage",
            s_wifi_setup_stage != NULL ? JS_NewString(ctx, s_wifi_setup_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "setupError",
            s_wifi_setup_stage != NULL ? JS_NewInt32(ctx, s_wifi_setup_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "stationNetifCleanupError",
            s_wifi_state.sta_detach_error != ESP_OK ? JS_NewInt32(ctx, s_wifi_state.sta_detach_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "stationNetifRestartRequired",
            JS_NewBool(s_wifi_state.sta_detach_error != ESP_OK)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "accessPointNetifCleanupError",
            esp32_mquickjs_wifi_ap_netif_cleanup_error() != ESP_OK
                ? JS_NewInt32(ctx, esp32_mquickjs_wifi_ap_netif_cleanup_error()) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "accessPointNetifRestartRequired",
            JS_NewBool(esp32_mquickjs_wifi_ap_netif_cleanup_error() != ESP_OK))) goto fail;

    if (!wifi_set_link_properties(ctx, status_obj, &status.link) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "associated",
            JS_NewBool(wifi_link_snapshot_valid(&status.link))) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "watch", esp32_mquickjs_wifi_watch_status(ctx)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "connectionCounters", wifi_connection_counters_to_js(ctx)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "accessPoint", esp32_mquickjs_wifi_ap_status(ctx)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "cleanupStage",
            s_wifi_state.cleanup_stage != NULL
                ? JS_NewString(ctx, s_wifi_state.cleanup_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "cleanupError",
            s_wifi_state.cleanup_stage != NULL
                ? JS_NewInt32(ctx, s_wifi_state.cleanup_error) : JS_NULL)) {
        goto fail;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, status_obj, "initialized",
                                     JS_NewBool(status.initialized)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "started",
                                     JS_NewBool(radio_status.started)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "connected",
                                     JS_NewBool(status.connected)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "scanning",
                                     JS_NewBool(status.scanning)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "scanDraining",
                                     JS_NewBool(status.scan_draining)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "scanCleanupError",
            status.scan_cleanup_error != ESP_OK
                ? JS_NewInt32(ctx, status.scan_cleanup_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "connectDraining",
            JS_NewBool(status.connect_draining)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "disconnectCleanupError",
            status.disconnect_cleanup_error != ESP_OK
                ? JS_NewInt32(ctx, status.disconnect_cleanup_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "connectTimerError",
            status.connect_timer_error != ESP_OK
                ? JS_NewInt32(ctx, status.connect_timer_error) : JS_NULL) ||
        !esp32_mquickjs_wifi_set_ssid_properties(ctx, status_obj, (const uint8_t *)status.ssid,
            strnlen(status.ssid, 32)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "lastDisconnectReason",
                                     JS_NewInt32(ctx, status.last_disconnect_reason)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "lastDisconnectReasonName",
                                     JS_NewString(ctx, wifi_reason_to_string(status.last_disconnect_reason))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, status_obj, "droppedDriverEvents",
            JS_NewUint32(
                ctx, atomic_load_explicit(
                         &s_wifi_state.dropped_driver_events,
                         memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "radio",
                                         *radio_obj)) {
        goto fail;
    }

    JS_PopGCRef(ctx, &radio_ref);
    return JS_PopGCRef(ctx, &status_ref);

fail:
    JS_PopGCRef(ctx, &radio_ref);
    JS_PopGCRef(ctx, &status_ref);
    return JS_EXCEPTION;
}

JSValue esp32_mquickjs_wifi_make_status_object(JSContext *ctx)
{
    return wifi_make_status_object(ctx);
}

JSValue esp32_mquickjs_wifi_throw_operation_error(
    JSContext *ctx,
    const char *code,
    const char *operation,
    esp_err_t err,
    int32_t disconnect_reason,
    uint32_t scan_status)
{
    esp32_mquickjs_wifi_status_t status;
    esp32_mquickjs_wifi_radio_status_t radio = {0};
    (void)esp32_mquickjs_wifi_radio_get_status(&radio);
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    JSValue result;
    bool has_status = esp32_mquickjs_wifi_get_status(&status) == ESP_OK;

    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "setupStage",
            s_wifi_setup_stage != NULL ? JS_NewString(ctx, s_wifi_setup_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "cleanupStage",
            s_wifi_state.cleanup_stage != NULL ? JS_NewString(ctx, s_wifi_state.cleanup_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "restartRequired",
            JS_NewBool(radio.restart_required || s_wifi_state.sta_detach_error != ESP_OK ||
                       esp32_mquickjs_wifi_ap_netif_cleanup_error() != ESP_OK)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "espCode", JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "espName",
            JS_NewString(ctx, esp_err_to_name(err))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "ssid",
            has_status && status.ssid[0] != '\0'
                ? esp32_mquickjs_wifi_ssid_text(ctx, (const uint8_t *)status.ssid, strnlen(status.ssid, 32))
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "disconnectReason",
            disconnect_reason >= 0
                ? JS_NewInt32(ctx, disconnect_reason)
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "disconnectReasonName",
            disconnect_reason >= 0
                ? JS_NewString(ctx, wifi_reason_to_string(disconnect_reason))
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "scanStatus",
            scan_status != UINT32_MAX
                ? JS_NewUint32(ctx, scan_status)
                : JS_NULL)) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_throw_native_error(
        ctx, code, operation, "Wi-Fi operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

