99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
/* Capture failures do not query Radio or call a driver. Execution failures
 * include only records reached by this call, never an old transaction's data. */
JSValue esp32_mquickjs_wifi_throw_configuration_error(JSContext *ctx, esp_err_t error,
    const char *option, const esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    esp32_mquickjs_wifi_radio_status_t radio = {0};
    bool activation = false;
    if (execution != NULL) {
        (void)esp32_mquickjs_wifi_radio_get_status(&radio);
        activation = execution->resume_attempted && radio.fault_stage != NULL &&
            (strcmp(radio.fault_stage, "tx-power-snapshot") == 0 ||
             strcmp(radio.fault_stage, "tx-power-config") == 0 ||
             strcmp(radio.fault_stage, "tx-power-readback") == 0);
    }
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage",
            JS_NewString(ctx, execution != NULL ? execution->stage : "capture")) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "option", option != NULL ? JS_NewString(ctx, option) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, error)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espName", JS_NewString(ctx, esp_err_to_name(error))) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "lifecycleAdmitted", JS_NewBool(execution != NULL && execution->admitted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stopAttempted", JS_NewBool(execution != NULL && execution->stop_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "cleanupPending", JS_NewBool(execution != NULL && s_wifi_configuration_cleanup)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "restartRequired", JS_NewBool(execution != NULL &&
            (radio.restart_required || s_wifi_state.sta_detach_error != ESP_OK ||
             esp32_mquickjs_wifi_ap_netif_cleanup_error() != ESP_OK))) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "configuration",
            execution != NULL && execution->configuration_attempted ? wifi_make_configuration_status(ctx, &radio.configuration) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "activation",
            activation ? wifi_make_configuration_status(ctx, &radio.activation) : JS_NULL)) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx,
        error == ESP_ERR_NOT_SUPPORTED ? "WIFI_CONFIG_UNSUPPORTED" : "WIFI_CONFIG_FAILED",
        "wifi.configure", "Wi-Fi configuration failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

static JSValue wifi_throw_connect_error(JSContext *ctx, esp_err_t err)
{
    esp32_mquickjs_wifi_status_t status;
    int32_t disconnect_reason = -1;

    if (esp32_mquickjs_wifi_get_status(&status) == ESP_OK) {
        disconnect_reason = status.last_disconnect_reason;
    }
    return esp32_mquickjs_wifi_throw_operation_error(
        ctx,
        err == ESP_ERR_TIMEOUT ? "WIFI_CONNECT_TIMEOUT"
                               : "WIFI_CONNECT_FAILED",
        "wifi.connect", err, disconnect_reason, UINT32_MAX);
}

JSValue esp32_mquickjs_wifi_throw_connect_error(JSContext *ctx, esp_err_t err)
{
    return wifi_throw_connect_error(ctx, err);
}

static JSValue wifi_throw_scan_error(JSContext *ctx, esp_err_t err)
{
    const char *code = err == ESP_ERR_WIFI_STATE
                           ? "WIFI_SCAN_BUSY"
                           : err == ESP_ERR_WIFI_TIMEOUT
                                 ? "WIFI_SCAN_TIMEOUT"
                                 : "WIFI_SCAN_FAILED";
    return esp32_mquickjs_wifi_throw_operation_error(
        ctx, code, "wifi.scan", err, -1, UINT32_MAX);
}

JSValue esp32_mquickjs_wifi_throw_scan_error(JSContext *ctx, esp_err_t err)
{
    return wifi_throw_scan_error(ctx, err);
}

static int js_value_to_timeout_ms(JSContext *ctx,
                                  JSValue value,
                                  uint32_t default_timeout_ms,
                                  uint32_t *out_timeout_ms)
{
    if (JS_IsUndefined(value)) {
        *out_timeout_ms = default_timeout_ms;
        return 0;
    }
    if (!esp32_mquickjs_value_to_bounded_u32(
            ctx, value, 0, INT32_MAX, out_timeout_ms)) {
        return -1;
    }
    return 0;
}

int esp32_mquickjs_wifi_value_to_timeout_ms(JSContext *ctx,
                                            JSValue value,
                                            uint32_t default_timeout_ms,
                                            uint32_t *out_timeout_ms)
{
    return js_value_to_timeout_ms(ctx, value, default_timeout_ms, out_timeout_ms);
}

esp_err_t esp32_mquickjs_wifi_get_status(esp32_mquickjs_wifi_status_t *status)
{
    if (status == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    memset(status, 0, sizeof(*status));
    if (!s_wifi_state.initialized) {
        return ESP_OK;
    }

    wifi_lock();
    *status = s_wifi_state.status;
    status->connect_draining = s_wifi_state.connect_draining;
    status->disconnect_cleanup_error = s_wifi_state.disconnect_cleanup_error;
    status->scan_draining = s_wifi_state.scan_draining;
    status->scan_cleanup_error = s_wifi_state.scan_cleanup_error;
    wifi_unlock();
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_prepare_connect_timer(void)
{
    atomic_store_explicit(&s_wifi_timeout_armed_generation, 0, memory_order_release);
    esp_err_t err = s_wifi_state.connect_timeout_timer != NULL
        ? esp_timer_stop_blocking(s_wifi_state.connect_timeout_timer,
                                  pdMS_TO_TICKS(1000)) : ESP_OK;
    /* Clear only after the callback barrier. A callback already in flight
     * may publish its old generation while stop_blocking is waiting. */
    if (err == ESP_OK)
        atomic_store_explicit(&s_wifi_timeout_pending, 0, memory_order_release);
    wifi_lock();
    s_wifi_state.status.connect_timer_error = err;
    wifi_unlock();
    if (err != ESP_OK)
        ESP_LOGE(TAG, "Wi-Fi connect timer cleanup pending: %s", esp_err_to_name(err));
    return err;
}

static esp_err_t wifi_start_connect_reserved(const wifi_config_t *config,
                                            uint32_t timeout_ms)
{
    wifi_config_t applied_config;
    esp_err_t err;
    bool needs_disconnect = false;
    size_t ssid_len;

    if (config == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    ESP_RETURN_ON_ERROR(esp32_mquickjs_wifi_prepare_connect_timer(), TAG,
                        "previous connect timer callback has not exited");
    wifi_lock();
    needs_disconnect = s_wifi_state.status.connected || s_wifi_state.connect_in_progress ||
        s_wifi_state.connect_draining;
    wifi_unlock();
    if (needs_disconnect) {
        err = wifi_request_disconnect();
        if (err != ESP_OK) return err;
        wifi_lock();
        bool pending = s_wifi_state.connect_draining;
        wifi_unlock();
        if (pending) {
            bool interrupted = false;
            (void)wifi_wait_for_bits(WIFI_LINK_DRAINED_BIT, true, timeout_ms, &interrupted);
            wifi_lock();
            pending = s_wifi_state.connect_draining;
            wifi_unlock();
            if (interrupted || pending)
                return interrupted ? ESP_ERR_INVALID_STATE : ESP_ERR_TIMEOUT;
        }
    }
    if (!config->sta.pmf_cfg.capable) {
        /* The stopped transaction already applied PMF. A second set_config
         * after START would enable it again. Under the CONNECT reservation,
         * verify the whole accepted config before submitting native connect. */
        memset(&applied_config, 0, sizeof(applied_config));
        err = esp_wifi_get_config(WIFI_IF_STA, &applied_config);
        if (err == ESP_OK &&
            !esp32_mquickjs_wifi_radio_accept_station_config(config, &applied_config))
            err = ESP_ERR_INVALID_RESPONSE;
    } else {
        applied_config = *config;
        err = esp_wifi_set_config(WIFI_IF_STA, &applied_config);
    }
    esp32_mquickjs_wireless_secure_zero(&applied_config, sizeof(applied_config));
    if (err != ESP_OK) return err;

    xEventGroupClearBits(s_wifi_state.event_group, WIFI_CONNECTED_BIT | WIFI_FAILED_BIT);

    wifi_lock();
    s_wifi_state.connect_in_progress = true;
    s_wifi_state.status.connected = false;
    memset(&s_wifi_state.status.link, 0, sizeof(s_wifi_state.status.link));
    s_wifi_state.status.last_disconnect_reason = 0;
    ssid_len = strnlen((const char *)config->sta.ssid,
                       sizeof(config->sta.ssid));
    memcpy(s_wifi_state.status.ssid, config->sta.ssid, ssid_len);
    s_wifi_state.status.ssid[ssid_len] = '\0';
    wifi_unlock();

    wifi_stop_connect_timeout_timer();
    if (s_wifi_state.connect_queue != NULL) {
        xQueueReset(s_wifi_state.connect_queue);
    }

    wifi_connection_note_submit();
    err = esp_wifi_connect();
    if (err != ESP_OK) {
        wifi_connection_note_failure();
        wifi_lock();
        s_wifi_state.connect_in_progress = false;
        wifi_unlock();
        ESP_LOGE(TAG, "esp_wifi_connect() failed: %s", esp_err_to_name(err));
        return err;
    }
    if (timeout_ms == 0) {
        timeout_ms = 1;
    }
    atomic_store_explicit(&s_wifi_timeout_armed_generation,
                          s_wifi_state.connect_generation, memory_order_release);
    err = esp_timer_start_once(s_wifi_state.connect_timeout_timer,
                               (uint64_t)timeout_ms * 1000ULL);
    if (err != ESP_OK) {
        atomic_store_explicit(&s_wifi_timeout_armed_generation, 0, memory_order_release);
        wifi_lock();
        s_wifi_state.status.connect_timer_error = err;
        wifi_begin_disconnect_locked();
        wifi_unlock();
        (void)wifi_request_disconnect();
        ESP_LOGE(TAG, "esp_timer_start_once(connect_timeout_timer) failed: %s",
                 esp_err_to_name(err));
    }
    return err;
}

esp_err_t esp32_mquickjs_wifi_start_connect(const wifi_config_t *config,
                                            uint32_t timeout_ms)
{
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    esp_err_t err = esp32_mquickjs_wifi_ensure_started();
    if (err != ESP_OK) return err;
    err = wifi_prepare_radio_operation(ESP32_MQUICKJS_WIFI_RADIO_OPERATION_CONNECT);
    if (err != ESP_OK) return err;
    wifi_lock();
    s_wifi_state.connect_start_active = true;
    wifi_unlock();
    err = wifi_start_connect_reserved(config, timeout_ms);
    wifi_lock();
    s_wifi_state.connect_start_active = false;
    wifi_unlock();
    wifi_release_radio_operation();
    return err;
}

esp_err_t esp32_mquickjs_wifi_start_disconnect(bool *out_pending)
{
    esp_err_t err;

    if (out_pending == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    *out_pending = false;

