99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
    if (!s_wifi_state.initialized || !s_wifi_state.started) {
        return ESP_OK;
    }

    err = wifi_request_disconnect();
    wifi_lock();
    /* Public disconnect completes at the native terminal; reuse still waits
     * for the IP fence. A retry after that terminal must not wait for a
     * second DISCONNECTED event that the driver will never send. */
    *out_pending = s_wifi_state.connect_draining && !s_wifi_state.disconnect_seen;
    wifi_unlock();
    return err;
}

static bool wifi_parse_interface(JSContext *ctx, JSValue value, wifi_interface_t *interface)
{
    if (!JS_IsString(ctx, value)) goto invalid;
    JSCStringBuf buffer;
    size_t length;
    const char *name = JS_ToCStringLen(ctx, &length, value, &buffer);
    if (name == NULL) return false;
    if (length == 7 && memcmp(name, "station", 7) == 0) *interface = WIFI_IF_STA;
    else if (length == 12 && memcmp(name, "access-point", 12) == 0) *interface = WIFI_IF_AP;
    else goto invalid;
    return true;
invalid:
    JS_ThrowTypeError(ctx, "Wi-Fi interface must be station or access-point");
    return false;
}

JSValue js_wifi_get_mac(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.getMac expects one interface argument");
    wifi_interface_t interface;
    if (!wifi_parse_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    uint8_t mac[6];
    esp_err_t err = esp32_mquickjs_wifi_radio_get_mac(interface, mac);
    if (err != ESP_OK)
        return esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_MAC_FAILED", "wifi.getMac", err, 0, 0);
    char address[18];
    snprintf(address, sizeof(address), MACSTR, MAC2STR(mac));
    return JS_NewString(ctx, address);
}

static const char *wifi_cipher_name(wifi_cipher_type_t cipher)
{
    switch (cipher) {
    case WIFI_CIPHER_TYPE_NONE: return "none";
    case WIFI_CIPHER_TYPE_WEP40: return "wep40";
    case WIFI_CIPHER_TYPE_WEP104: return "wep104";
    case WIFI_CIPHER_TYPE_TKIP: return "tkip";
    case WIFI_CIPHER_TYPE_CCMP: return "ccmp";
    case WIFI_CIPHER_TYPE_TKIP_CCMP: return "tkip-ccmp";
    case WIFI_CIPHER_TYPE_AES_CMAC128: return "aes-cmac128";
    case WIFI_CIPHER_TYPE_SMS4: return "sms4";
    case WIFI_CIPHER_TYPE_GCMP: return "gcmp";
    case WIFI_CIPHER_TYPE_GCMP256: return "gcmp256";
    case WIFI_CIPHER_TYPE_AES_GMAC128: return "aes-gmac128";
    case WIFI_CIPHER_TYPE_AES_GMAC256: return "aes-gmac256";
    default: return NULL;
    }
}

JSValue esp32_mquickjs_wifi_country_to_js(JSContext *ctx, const wifi_country_t *country)
{
    bool code_valid = (country->cc[0] >= 'A' && country->cc[0] <= 'Z' &&
                       country->cc[1] >= 'A' && country->cc[1] <= 'Z') ||
                      (country->cc[0] == '0' && country->cc[1] == '1');
    if (!code_valid) return JS_NULL;
    const char *environment = country->cc[2] == 'I' ? "indoor" :
                              country->cc[2] == 'O' ? "outdoor" : country->cc[2] == 'X' ? "X" : NULL;
    const char *policy = country->policy == WIFI_COUNTRY_POLICY_AUTO ? "auto" :
                         country->policy == WIFI_COUNTRY_POLICY_MANUAL ? "manual" : NULL;
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "code", JS_NewStringLen(ctx, country->cc, 2)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "environment", environment ? JS_NewString(ctx, environment) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "policy", policy ? JS_NewString(ctx, policy) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "startChannel", JS_NewUint32(ctx, country->schan)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channelCount", JS_NewUint32(ctx, country->nchan)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "maxTxPowerDbm", JS_NewInt32(ctx, country->max_tx_power)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ghz5ChannelMask",
#if CONFIG_SOC_WIFI_SUPPORT_5G
            JS_NewUint32(ctx, country->wifi_5g_channel_mask)
#else
            JS_NULL
#endif
        )) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue wifi_scan_protocols_to_js(JSContext *ctx, const wifi_ap_record_t *record)
{
    static const char *const names[] = {"11b", "11g", "11n", "11a", "11ac", "11ax", "lr"};
    const bool flags[] = {record->phy_11b, record->phy_11g, record->phy_11n,
                         record->phy_11a, record->phy_11ac, record->phy_11ax, record->phy_lr};
    JSGCRef array_ref, value_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) goto fail;
    uint32_t count = 0;
    for (size_t i = 0; i < sizeof(flags) / sizeof(*flags); ++i) {
        if (!flags[i]) continue;
        *value = JS_NewString(ctx, names[i]);
        if (JS_IsException(*value) || JS_IsException(JS_SetPropertyUint32(ctx, *array, count++, *value))) goto fail;
    }
    JS_PopGCRef(ctx, &value_ref);
    return JS_PopGCRef(ctx, &array_ref);
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_scan_capabilities_to_js(JSContext *ctx, const wifi_ap_record_t *record)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "wps", JS_NewBool(record->wps)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ftmResponder", JS_NewBool(record->ftm_responder)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ftmInitiator", JS_NewBool(record->ftm_initiator)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "he", JS_NewBool(record->phy_11ax)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "vht", JS_NewBool(record->phy_11ac))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static JSValue wifi_make_scan_entry_object(JSContext *ctx, const wifi_ap_record_t *record)
{
    JSGCRef entry_ref;
    JSValue *entry;
    char bssid[WIFI_SCAN_BSSID_STR_LEN];

    entry = JS_PushGCRef(ctx, &entry_ref);
    *entry = JS_NewObject(ctx);
    if (JS_IsException(*entry)) {
        goto fail;
    }

    snprintf(bssid, sizeof(bssid), MACSTR, MAC2STR(record->bssid));
    const char *secondary = record->second == WIFI_SECOND_CHAN_NONE ? "none" :
                            record->second == WIFI_SECOND_CHAN_ABOVE ? "above" :
                            record->second == WIFI_SECOND_CHAN_BELOW ? "below" : NULL;
    const char *band = record->primary >= 1 && record->primary <= 14 ? "2.4GHz" :
        esp32_mquickjs_wifi_radio_5ghz_channel_bit(record->primary) != 0 ? "5GHz" : NULL;
    const char *pairwise = wifi_cipher_name(record->pairwise_cipher);
    const char *group = wifi_cipher_name(record->group_cipher);
    if (!esp32_mquickjs_wifi_set_ssid_properties(ctx, entry, record->ssid,
            strnlen((const char *)record->ssid, 32)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "bssid",
                                     JS_NewString(ctx, bssid)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "rssi",
                                     JS_NewInt32(ctx, record->rssi)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "channel",
                                     JS_NewInt32(ctx, record->primary)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "authMode",
                                     JS_NewString(ctx, wifi_authmode_to_string(record->authmode))) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "hidden",
                                     JS_NewBool(record->ssid[0] == '\0')) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "secondaryChannel", secondary ? JS_NewString(ctx, secondary) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "band", band ? JS_NewString(ctx, band) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "pairwiseCipher", pairwise ? JS_NewString(ctx, pairwise) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "groupCipher", group ? JS_NewString(ctx, group) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "antenna",
            record->ant == WIFI_ANT_ANT0 || record->ant == WIFI_ANT_ANT1 ? JS_NewInt32(ctx, record->ant) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "protocols", wifi_scan_protocols_to_js(ctx, record)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "country", esp32_mquickjs_wifi_country_to_js(ctx, &record->country)) ||
        !esp32_mquickjs_set_property_ref(ctx, entry, "capabilities", wifi_scan_capabilities_to_js(ctx, record))) {
        goto fail;
    }

    return JS_PopGCRef(ctx, &entry_ref);

