99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
fail:
    JS_PopGCRef(ctx, &entry_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_make_scan_results_array(JSContext *ctx, uint16_t max_records)
{
    JSGCRef results_ref;
    JSValue *results;
    wifi_ap_record_t *records = NULL;
    uint16_t count = 0;
    uint16_t i;
    esp_err_t err;

    if (max_records == 0 || max_records > ESP32_MQUICKJS_WIFI_MAX_SCAN_RECORDS)
        return JS_ThrowRangeError(ctx, "wifi.scan maxRecords is out of range");
    results = JS_PushGCRef(ctx, &results_ref);
    *results = JS_NewArray(ctx, 0);
    if (JS_IsException(*results)) {
        goto fail;
    }

    err = esp_wifi_scan_get_ap_num(&count);
    if (err != ESP_OK) {
        JS_ThrowInternalError(ctx, "esp_wifi_scan_get_ap_num() failed: %s", esp_err_to_name(err));
        goto fail;
    }

    if (count == 0) {
        return JS_PopGCRef(ctx, &results_ref);
    }
    if (count > max_records) {
        count = max_records;
    }

    records = esp32_mquickjs_memory_wireless_calloc("wifi", count, sizeof(*records), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    if (records == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }

    err = esp_wifi_scan_get_ap_records(&count, records);
    if (err != ESP_OK) {
        JS_ThrowInternalError(ctx, "esp_wifi_scan_get_ap_records() failed: %s", esp_err_to_name(err));
        goto fail;
    }

    /* Successful get_ap_records releases the SDK list, even if JS conversion
     * below fails. Do not repeat that successful cleanup suffix. */
    esp32_mquickjs_wifi_scan_results_consumed();
    for (i = 0; i < count; ++i) {
        JSGCRef entry_ref;
        JSValue *entry = JS_PushGCRef(ctx, &entry_ref);

        *entry = wifi_make_scan_entry_object(ctx, &records[i]);
        if (JS_IsException(*entry) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *results, i, *entry))) {
            JS_PopGCRef(ctx, &entry_ref);
            goto fail;
        }
        JS_PopGCRef(ctx, &entry_ref);
    }

    esp32_mquickjs_memory_payload_free(records);
    return JS_PopGCRef(ctx, &results_ref);

fail:
    esp32_mquickjs_memory_payload_free(records);
    JS_PopGCRef(ctx, &results_ref);
    return JS_EXCEPTION;
}

JSValue esp32_mquickjs_wifi_scan_record_to_js(JSContext *ctx, const wifi_ap_record_t *record)
{
    return wifi_make_scan_entry_object(ctx, record);
}

JSValue esp32_mquickjs_wifi_make_scan_results_array(JSContext *ctx, uint16_t max_records)
{
    return wifi_make_scan_results_array(ctx, max_records);
}

esp_err_t esp32_mquickjs_wifi_reopen_ap_shared(wifi_config_t *config, bool *handled)
{
    if (config == NULL || handled == NULL) return ESP_ERR_INVALID_ARG;
    *handled = s_wifi_state.radio_lease.acquired || s_wifi_application.acquired;
    if (!*handled) return ESP_OK;
    if (s_wifi_configuration_cleanup || s_wifi_ap_stop_cleanup || s_wifi_lifecycle.identity != 0U ||
        s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL || !wifi_helpers_idle(true))
        return ESP_ERR_INVALID_STATE;
    wifi_release_radio_operation();
    esp_err_t err = esp32_mquickjs_wifi_ap_reopen(&s_wifi_application, &s_wifi_state.radio_lease,
                                               config, &s_wifi_lifecycle);
    /* A failed post-admission attempt now owns the AP removal suffix. The
     * existing public stop/runtime takeover drains Station before whole cleanup. */
    if (s_wifi_lifecycle.identity != 0U) s_wifi_ap_stop_cleanup = true;
    return err;
}

bool esp32_mquickjs_wifi_ap_stop_pending(void)
{
    return s_wifi_ap_stop_cleanup;
}

esp_err_t esp32_mquickjs_wifi_stop_ap_shared(bool *handled)
{
    if (handled == NULL) return ESP_ERR_INVALID_ARG;
    *handled = s_wifi_ap_stop_cleanup || s_wifi_state.radio_lease.acquired || s_wifi_application.acquired;
    if (!*handled) return ESP_OK;
    if (!s_wifi_ap_stop_cleanup) {
        if (s_wifi_configuration_cleanup || s_wifi_lifecycle.identity != 0U ||
            s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL ||
            !wifi_helpers_idle(true)) return ESP_ERR_INVALID_STATE;
        wifi_release_radio_operation();
        esp_err_t err = esp32_mquickjs_wifi_ap_begin_partial_stop(
            &s_wifi_application, &s_wifi_state.radio_lease, &s_wifi_lifecycle);
        if (err != ESP_OK) return err;
        s_wifi_ap_stop_cleanup = true;
    }
    esp_err_t err = esp32_mquickjs_wifi_radio_quiesce_ap_lifecycle(&s_wifi_lifecycle);
    if (err != ESP_OK) return err;
    err = esp32_mquickjs_wifi_ap_retire_partial_stop(&s_wifi_lifecycle);
    if (err != ESP_OK) return err;
    err = esp32_mquickjs_wifi_ap_finish_partial_stop(&s_wifi_lifecycle);
    if (err == ESP_OK) s_wifi_ap_stop_cleanup = false;
    return err;
}

/* Explicit whole stop/runtime retirement, after Station and native operations
 * have drained. Keep the same reservation and AP netif cleanup suffix. */
static esp_err_t wifi_adopt_ap_stop_cleanup(void)
{
    if (!s_wifi_ap_stop_cleanup || s_wifi_configuration_cleanup || !wifi_helpers_idle(false))
        return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_ap_adopt_partial_stop(&s_wifi_lifecycle);
    if (err != ESP_OK) return err;
    s_wifi_ap_stop_cleanup = false;
    s_wifi_configuration_cleanup = true;
    s_wifi_configuration_mode = WIFI_MODE_APSTA;
    s_wifi_configuration_stop_only = false;
    s_wifi_configuration_disconnect_pending = false;
    s_wifi_state.runtime_cleanup_pending = true;
    return ESP_OK;
}

/* One reservation spans both helpers. No public Future or native operation
 * may remain at handoff; failure before begin has no owner/driver effects. */
static esp_err_t wifi_begin_configuration_cleanup(bool allow_disconnect)
{
    if (s_wifi_configuration_cleanup) return ESP_OK;
    if (s_wifi_lifecycle.identity != 0U || !wifi_helpers_idle(allow_disconnect)) return ESP_ERR_INVALID_STATE;
    wifi_release_radio_operation();
    esp_err_t err = esp32_mquickjs_wifi_ap_begin_configuration(
        &s_wifi_application, &s_wifi_state.radio_lease, &s_wifi_lifecycle);
    if (err != ESP_OK) return err;
    s_wifi_configuration_cleanup = true;
    s_wifi_configuration_mode = WIFI_MODE_NULL;
    s_wifi_configuration_stop_only = false;
    wifi_lock();
    s_wifi_configuration_disconnect_pending = s_wifi_state.status.connected || s_wifi_state.connect_draining;
    wifi_unlock();
    return ESP_OK;
}

/* Configuration admission also resolves defaults and requires permission for
 * every running AP. Cleanup/explicit stop keep their separate authorization. */
static esp_err_t wifi_begin_selected_configuration(
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    const esp32_mquickjs_wifi_radio_start_controls_t *start_controls)
{
    if (s_wifi_configuration_cleanup || s_wifi_lifecycle.identity != 0U ||
        !wifi_helpers_idle(selection->allow_disconnect)) return ESP_ERR_INVALID_STATE;
    wifi_release_radio_operation();
    esp_err_t err = esp32_mquickjs_wifi_ap_begin_selected_configuration(
        &s_wifi_application, &s_wifi_state.radio_lease, selection, controls, start_controls, &s_wifi_lifecycle);
    if (err != ESP_OK) return err;
    s_wifi_configuration_cleanup = true;
    s_wifi_configuration_mode = selection->mode;
    s_wifi_configuration_stop_only = false;
    wifi_lock();
    s_wifi_configuration_disconnect_pending = s_wifi_state.status.connected || s_wifi_state.connect_draining;
    wifi_unlock();
    return ESP_OK;
}

/* Only the admitted configuration may disconnect this established Station.
 * Pending public Futures/scan/connect were rejected before taking the token.
 * Reuse the native disconnect epoch/fence; never run a JS event poller here. */
static esp_err_t wifi_finish_configuration_disconnect(void)
{
    if (!s_wifi_configuration_disconnect_pending) return ESP_OK;
    if (!s_wifi_configuration_cleanup || s_wifi_lifecycle.identity == 0U)
        return ESP_ERR_INVALID_STATE;
    esp_err_t err = wifi_request_disconnect();
    if (err != ESP_OK) return err;
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_native_wait_t wait;
    esp32_mquickjs_native_wait_begin(runtime, &wait);
    TickType_t started = xTaskGetTickCount();
    TickType_t timeout = esp32_mquickjs_wifi_wait_remaining(pdMS_TO_TICKS(1000));
    for (;;) {
        wifi_lock();
        bool pending = s_wifi_state.status.connected || s_wifi_state.connect_draining ||
            s_wifi_state.disconnect_active || s_wifi_state.connect_start_active;
        bool exhausted = s_wifi_state.disconnect_epoch_exhausted;
        wifi_unlock();
        if (!pending) {
            s_wifi_configuration_disconnect_pending = false;
            err = ESP_OK;
            break;
        }
        if (exhausted || !esp32_mquickjs_cooperate(runtime)) {
            err = ESP_ERR_INVALID_STATE;
            break;
        }
        /* A saturated event queue retains the unposted native fence. Do not
         * resubmit an already accepted disconnect while waiting for it. */
        err = wifi_post_disconnect_fence();
        if (err != ESP_OK) break;
        if ((TickType_t)(xTaskGetTickCount() - started) >= timeout) {
            err = ESP_ERR_TIMEOUT;
            break;
        }
        vTaskDelay(1);
    }
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return err;
}

#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static esp_err_t wifi_finish_enterprise_clear(void)
{
    if (!s_wifi_eap_stop.control.identity) return ESP_OK;
    esp_err_t error;
    if (s_wifi_eap_stop.binding) {
        esp32_mquickjs_wifi_eap_install_result_t result;
        s_wifi_state.cleanup_stage = "configuration-enterprise-clear";
        error = esp32_mquickjs_wifi_radio_eap_clear_lifecycle(s_wifi_eap_stop.binding, &s_wifi_lifecycle, &result);
        if (error != ESP_OK) return error;
        s_wifi_eap_stop.binding = 0;
    }
    if (s_wifi_eap_stop.release_ap) {
        s_wifi_state.cleanup_stage = "configuration-enterprise-ap-release";
        error = esp32_mquickjs_wifi_ap_release_enterprise_stop(&s_wifi_lifecycle);
        if (error != ESP_OK) return error;
        s_wifi_eap_stop.release_ap = false;
    }
    return ESP_OK;
}
#endif

static esp_err_t wifi_finish_configuration_cleanup(void)
{
    esp_err_t err;
    if (!s_wifi_configuration_cleanup || s_wifi_lifecycle.identity == 0U)
        return ESP_ERR_INVALID_STATE;
    bool recovery = esp32_mquickjs_wifi_radio_recovery_active(&s_wifi_lifecycle);
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (s_wifi_eap_stop.control.identity) {
        s_wifi_state.runtime_cleanup_pending = true;
        err = wifi_finish_enterprise_clear();
        if (err != ESP_OK) goto pending;
    }
#endif
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = "configuration-vendor-ie-clear";
    err = esp32_mquickjs_wifi_radio_vendor_ie_clear_lifecycle(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    if (recovery) {
        s_wifi_state.cleanup_stage = "configuration-recovery-prepare";
        err = esp32_mquickjs_wifi_radio_prepare_recovery(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
    }
    s_wifi_state.cleanup_stage = "configuration-disconnect";
    err = wifi_finish_configuration_disconnect();
    if (err != ESP_OK) goto pending;
    /* Release is exact and idempotent. The lifecycle token excludes new owners
     * throughout the driver and helper suffix, including a failed retry. */
    esp32_mquickjs_wifi_radio_release(&s_wifi_application);
    esp32_mquickjs_wifi_radio_release(&s_wifi_state.radio_lease);
    s_wifi_state.cleanup_stage = "configuration-stop";
    err = recovery ? esp32_mquickjs_wifi_radio_stop_recovery(&s_wifi_lifecycle)
        : esp32_mquickjs_wifi_radio_quiesce_lifecycle(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    s_wifi_state.cleanup_stage = "configuration-ap-retire";
    err = recovery ? esp32_mquickjs_wifi_ap_retire_for_recovery(&s_wifi_lifecycle)
        : esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    err = recovery ? esp32_mquickjs_wifi_retire_for_recovery(&s_wifi_lifecycle)
        : wifi_cleanup_helper(false);
    if (err != ESP_OK) goto pending;
    if (recovery) {
        s_wifi_state.cleanup_stage = "configuration-recovery-shutdown";
        err = esp32_mquickjs_wifi_radio_shutdown_recovery(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
    }
    s_wifi_state.cleanup_stage = s_wifi_configuration_stop_only
        ? "configuration-finish-stop" : "configuration-shutdown";
    err = esp32_mquickjs_wifi_radio_finish_lifecycle(&s_wifi_lifecycle, !s_wifi_configuration_stop_only);
    if (err != ESP_OK) goto pending;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (s_wifi_eap_stop.control.identity) {
        /* Native clear and driver/helper suffix have returned. The exact config
         * token can finish even after runtime begin_close invalidated revision. */
        (void)esp32_mquickjs_wifi_eap_config_finish(&s_wifi_eap_stop.control, false);
        memset(&s_wifi_eap_stop, 0, sizeof(s_wifi_eap_stop));
    }
#endif
    s_wifi_configuration_cleanup = false;
    s_wifi_configuration_mode = WIFI_MODE_NULL;
    s_wifi_configuration_stop_only = false;
    s_wifi_state.runtime_cleanup_pending = false;
    s_wifi_state.cleanup_stage = NULL;
    s_wifi_state.cleanup_error = ESP_OK;
    return ESP_OK;
pending:
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_error = err;
    return err;
}

bool esp32_mquickjs_prepare_wifi_recovery_runtime_destroy(void)
{
    /* Only continue an already admitted physical recovery. Future cancellation
     * has ended public restoration; the exact central lifecycle owns cleanup.
     * Other configuration cleanup follows normal runtime deinit, after native
     * owners drain. Never grant a new recovery or borrow its original lease. */
    if (!s_wifi_configuration_cleanup ||
        !esp32_mquickjs_wifi_radio_recovery_active(&s_wifi_lifecycle)) return true;
    return wifi_finish_configuration_cleanup() == ESP_OK;
}

bool esp32_mquickjs_wifi_configuration_pending(void)
{
    return s_wifi_configuration_cleanup;
}

esp_err_t esp32_mquickjs_wifi_cleanup_ap_configuration(void)
{
    if (!s_wifi_configuration_cleanup || s_wifi_configuration_mode != WIFI_MODE_AP)
        return ESP_ERR_INVALID_STATE;
    return wifi_finish_configuration_cleanup();
}

static esp_err_t wifi_begin_start_configuration(
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection, bool *already_started)
{
    if (s_wifi_configuration_cleanup || s_wifi_ap_stop_cleanup || s_wifi_lifecycle.identity != 0U ||
        !wifi_helpers_idle(true)) return ESP_ERR_INVALID_STATE;
    wifi_release_radio_operation();
    esp_err_t err = esp32_mquickjs_wifi_ap_begin_start_configuration(
        &s_wifi_application, &s_wifi_state.radio_lease, selection, &s_wifi_lifecycle, already_started);
    if (err != ESP_OK || *already_started) return err;
    s_wifi_configuration_cleanup = true;
    s_wifi_configuration_mode = selection->mode;
    s_wifi_configuration_stop_only = false;
    s_wifi_configuration_disconnect_pending = false;
    return ESP_OK;
}

/* Matching running starts do not reconstruct helper/netif or mutate settings.
 * A Station-only Radio previously started by another feature can still acquire
 * the ordinary Wi-Fi helper owners through the existing exact lease path. */
static esp_err_t wifi_start_existing_running(const esp32_mquickjs_wifi_radio_configuration_selection_t *selection)
{
    if (!(selection->mode & WIFI_MODE_STA)) return ESP_OK;
    esp_err_t err = wifi_init_once();
    if (err == ESP_OK && !s_wifi_application.acquired)
        err = esp32_mquickjs_wifi_radio_acquire(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
                                               WIFI_MODE_STA, &s_wifi_application);
    if (err == ESP_OK) err = esp32_mquickjs_wifi_ensure_started();
    return err;
}

/* The exact admitted lifecycle and old helper retirement precede this common
 * reconstruction suffix. Ordinary restart and Action recovery replay the same
 * frozen credentials/policies and publish leases only after final readback. */
static esp_err_t wifi_restart_restore_interfaces(wifi_mode_t mode, wifi_config_t *stored_ap,
    esp32_mquickjs_wifi_configuration_execution_t *execution, bool restore_off)
{
    const char *stage = "restart-rebuild";
    esp_err_t err;
    err = esp32_mquickjs_wifi_radio_rebuild_restart_lifecycle(&s_wifi_lifecycle, mode);
    if (err != ESP_OK) goto pending;
    /* Dual-band replay can temporarily START Station even for final AP-only.
     * Install its handlers/netif before replay and retire it after final STOP. */
    stage = "restart-station-prepare";
    err = esp32_mquickjs_wifi_prepare_for_configuration(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    if (mode & WIFI_MODE_AP) {
        stage = "restart-ap-prepare";
        err = esp32_mquickjs_wifi_ap_prepare_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
    }
    stage = "restart-replay";
    if (execution != NULL) execution->configuration_attempted = true;
    err = esp32_mquickjs_wifi_radio_replay_restart_lifecycle(&s_wifi_lifecycle, mode);
    if (err != ESP_OK) goto pending;
    if (restore_off) {
        stage = "restart-off-resume";
        if (execution != NULL) execution->resume_attempted = true;
        err = esp32_mquickjs_wifi_radio_resume_off_restart_lifecycle(&s_wifi_lifecycle, mode);
        if (err != ESP_OK) goto pending;
        stage = "restart-off-ap-retire";
        err = esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
        stage = "restart-off-station-retire";
        err = wifi_cleanup_helper(false);
        if (err != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
        stage = "restart-off-finish";
        err = esp32_mquickjs_wifi_radio_finish_lifecycle(&s_wifi_lifecycle, false);
        if (err != ESP_OK) goto pending;
        goto complete;
    }
    if (!(mode & WIFI_MODE_STA)) {
        stage = "restart-temporary-station-retire";
        err = esp32_mquickjs_wifi_retire_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) { stage = s_wifi_state.cleanup_stage != NULL ? s_wifi_state.cleanup_stage : stage; goto pending; }
    }
    esp32_mquickjs_wifi_radio_lease_t *ap_slot = NULL;
    if (mode & WIFI_MODE_AP) {
        stage = "restart-ap-config";
        err = esp32_mquickjs_wifi_radio_copy_stopped_ap_configuration(&s_wifi_lifecycle, stored_ap);
        if (err != ESP_OK) goto pending;
        stage = "restart-ap-slot";
        ap_slot = esp32_mquickjs_wifi_ap_configuration_slot(&s_wifi_lifecycle);
        if (ap_slot == NULL) { err = ESP_ERR_INVALID_STATE; goto pending; }
    }
    stage = "restart-resume";
    if (execution != NULL) execution->resume_attempted = true;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (s_wifi_eap_stop.profile) {
        stage = "restart-enterprise-resume";
        esp32_mquickjs_wifi_eap_config_status_t config;
        esp32_mquickjs_wifi_eap_config_status(&config);
        if (!config.busy || config.closing) { err = ESP_ERR_INVALID_STATE; goto pending; }
        err = esp32_mquickjs_wifi_radio_eap_resume_restart(&s_wifi_lifecycle, mode,
            &s_wifi_application, &s_wifi_state.radio_lease, ap_slot, s_wifi_eap_stop.profile);
        s_wifi_eap_stop.binding = esp32_mquickjs_wifi_radio_eap_identity();
    } else
#endif
    err = esp32_mquickjs_wifi_radio_resume_lifecycle(&s_wifi_lifecycle, mode, true,
        (mode & WIFI_MODE_STA) ? &s_wifi_application : NULL,
        (mode & WIFI_MODE_STA) ? &s_wifi_state.radio_lease : NULL, ap_slot, NULL);
    if (err != ESP_OK) goto pending;
complete:
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (s_wifi_eap_stop.profile) {
        (void)esp32_mquickjs_wifi_eap_config_finish(&s_wifi_eap_stop.control, false);
        memset(&s_wifi_eap_stop, 0, sizeof(s_wifi_eap_stop));
    }
#endif
    s_wifi_configuration_cleanup = false;
    s_wifi_configuration_mode = WIFI_MODE_NULL;
    s_wifi_state.runtime_cleanup_pending = false;
    s_wifi_state.cleanup_stage = NULL;
    s_wifi_state.cleanup_error = ESP_OK;
    if (execution != NULL) execution->stage = "complete";
    return ESP_OK;
pending:
    /* Central stop/runtime cleanup owns the same reservation from here. Do
     * not continue restoration after a helper or driver failure, or discard
     * its frozen checkpoint before physical cleanup has completed. */
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = stage;
    s_wifi_state.cleanup_error = err;
    if (execution != NULL) execution->stage = stage;
    return err;
}

#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static esp_err_t wifi_begin_enterprise_restart(uint64_t binding, bool allow_ap_restart, wifi_mode_t *mode)
{
    esp32_mquickjs_wifi_eap_config_status_t config;
    esp32_mquickjs_wifi_eap_config_status(&config);
    esp32_mquickjs_wifi_eap_profile_t *profile = NULL;
    esp_err_t error = esp32_mquickjs_wifi_eap_config_begin(config.revision,
        ESP32_MQUICKJS_WIFI_EAP_CONFIG_ENABLE, &s_wifi_eap_stop.control, &profile);
    if (error != ESP_OK) return error;
    wifi_release_radio_operation();
    error = esp32_mquickjs_wifi_ap_begin_enterprise_restart(binding, &s_wifi_application,
        &s_wifi_state.radio_lease, profile, allow_ap_restart, &s_wifi_lifecycle, mode);
    if (error != ESP_OK) {
        (void)esp32_mquickjs_wifi_eap_config_finish(&s_wifi_eap_stop.control, false);
        return error;
    }
    s_wifi_eap_stop.binding = binding;
    s_wifi_eap_stop.profile = profile;
    s_wifi_eap_stop.release_ap = true;
    s_wifi_eap_stop.checkpoint_attempted = false;
    return ESP_OK;
}

