99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
static esp_err_t wifi_restart_enterprise_interfaces(wifi_config_t *stored_ap, bool allow_ap_restart,
    esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    const char *stage = "restart-enterprise-admission";
    if (execution) execution->stage = stage;
    esp32_mquickjs_wifi_eap_config_status_t config;
    esp32_mquickjs_wifi_eap_config_status(&config);
    wifi_mode_t mode = s_wifi_configuration_mode;
    if (!s_wifi_eap_stop.profile || !s_wifi_eap_stop.control.identity || !config.busy || config.closing ||
        !s_wifi_configuration_cleanup || !s_wifi_lifecycle.identity ||
        (mode != WIFI_MODE_STA && mode != WIFI_MODE_APSTA) || (mode == WIFI_MODE_APSTA && !allow_ap_restart))
        return ESP_ERR_INVALID_STATE;
    if (execution) execution->admitted = true;
    esp_err_t error = wifi_finish_enterprise_clear();
    if (error != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
    esp32_mquickjs_wifi_radio_release(&s_wifi_application);
    esp32_mquickjs_wifi_radio_release(&s_wifi_state.radio_lease);
    if (!s_wifi_eap_stop.checkpoint_attempted) {
        stage = "restart-enterprise-checkpoint";
        s_wifi_eap_stop.checkpoint_attempted = true;
        if (execution) execution->stop_attempted = true;
        error = esp32_mquickjs_wifi_radio_checkpoint_restart_lifecycle(&s_wifi_lifecycle, mode);
    } else {
        stage = "restart-enterprise-retry";
        esp32_mquickjs_wifi_radio_restart_selection_t selection = {.allow_ap_restart = allow_ap_restart};
        error = esp32_mquickjs_wifi_radio_admit_restart_retry(&s_wifi_lifecycle, &selection);
        if (error == ESP_OK && (selection.mode != mode || selection.cold || selection.restore_off)) error = ESP_ERR_INVALID_STATE;
        if (error == ESP_OK) {
            if (execution) execution->stop_attempted = true;
            error = esp32_mquickjs_wifi_radio_quiesce_lifecycle(&s_wifi_lifecycle);
        }
    }
    if (error != ESP_OK) goto pending;
    stage = "restart-enterprise-ap-retire";
    error = esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
    if (error != ESP_OK) goto pending;
    stage = "restart-enterprise-station-retire";
    error = wifi_cleanup_helper(false);
    if (error != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
    return wifi_restart_restore_interfaces(mode, stored_ap, execution, false);
pending:
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = stage;
    s_wifi_state.cleanup_error = error;
    if (execution) execution->stage = stage;
    return error;
}
#endif

static esp_err_t wifi_restart_retry_interfaces(bool allow_ap_restart,
    esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    const char *stage = "restart-retry-admission";
    if (execution != NULL) execution->stage = stage;
    if (!s_wifi_configuration_cleanup || s_wifi_lifecycle.identity == 0U ||
        s_wifi_configuration_stop_only || s_wifi_configuration_disconnect_pending ||
        s_wifi_ap_stop_cleanup || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_radio_restart_selection_t selection = {.allow_ap_restart = allow_ap_restart};
    esp_err_t err;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    bool enterprise = s_wifi_eap_stop.profile != NULL;
    if (enterprise) selection.mode = s_wifi_configuration_mode;
    err = enterprise ? ESP_OK : esp32_mquickjs_wifi_radio_admit_restart_retry(&s_wifi_lifecycle, &selection);
#else
    err = esp32_mquickjs_wifi_radio_admit_restart_retry(&s_wifi_lifecycle, &selection);
#endif
    if (err != ESP_OK) return err;
    if (execution != NULL) execution->admitted = true;
    wifi_config_t *stored_ap = NULL;
    if (!selection.restore_off && (selection.mode & WIFI_MODE_AP)) {
        stage = "restart-retry-ap-allocate";
        stored_ap = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*stored_ap),
            ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (stored_ap == NULL) { err = ESP_ERR_NO_MEM; goto pending; }
    }
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_configuration_mode = selection.mode;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (enterprise) {
        err = wifi_restart_enterprise_interfaces(stored_ap, allow_ap_restart, execution);
        goto free_ap;
    }
#endif
    stage = "restart-retry-stop";
    if (execution != NULL) execution->stop_attempted = true;
    err = esp32_mquickjs_wifi_radio_quiesce_lifecycle(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    stage = "restart-retry-ap-retire";
    err = esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    stage = "restart-retry-station-retire";
    err = wifi_cleanup_helper(false);
    if (err != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
    /* Rebuild uses the original complete checkpoint, including its off flag.
     * Never checkpoint the faulted generation or finish/discard the token on
     * the way to replay. SDK/helper suffixes record their own completed work. */
    err = wifi_restart_restore_interfaces(selection.mode, stored_ap, execution, selection.restore_off);
    goto free_ap;
pending:
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = stage;
    s_wifi_state.cleanup_error = err;
    if (execution != NULL) execution->stage = stage;
free_ap:
    if (stored_ap != NULL) {
        esp32_mquickjs_wireless_secure_zero(stored_ap, sizeof(*stored_ap));
        esp32_mquickjs_memory_payload_free(stored_ap);
    }
    return err;
}

/* Internal reconstruction shared by managed-owner and zero-owner admission.
 * Never disconnect a Station or cancel a pending native operation here. */
static esp_err_t wifi_restart_interfaces_inner(wifi_mode_t mode, bool stopped_only,
    esp32_mquickjs_wifi_configuration_execution_t *execution, const bool *wapi_enabled,
    bool allow_ap_restart)
{
    if (execution != NULL) *execution = (esp32_mquickjs_wifi_configuration_execution_t){.stage = "restart-admission"};
    /* Only an explicit public restart may resume a retained full checkpoint.
     * WAPI controls and other coordinators keep their own operation ownership. */
    if (stopped_only && wapi_enabled == NULL && s_wifi_configuration_cleanup)
        return wifi_restart_retry_interfaces(allow_ap_restart, execution);
    if (!stopped_only && mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA)
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (mode & WIFI_MODE_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    if (s_wifi_configuration_cleanup || s_wifi_ap_stop_cleanup || s_wifi_lifecycle.identity != 0U ||
        s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL ||
        !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    /* Reserve fallible AP validation storage before transferring any owner. */
    wifi_config_t *stored_ap = NULL;
    bool needs_ap_storage = (mode & WIFI_MODE_AP) != 0;
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    /* The atomic selector has not resolved the mode yet. */
    needs_ap_storage = needs_ap_storage || stopped_only;
#endif
    if (needs_ap_storage) {
        stored_ap = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*stored_ap), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (stored_ap == NULL) {
            if (execution != NULL) execution->stage = "restart-ap-allocate";
            return ESP_ERR_NO_MEM;
        }
    }
    esp_err_t err;
    bool cold_source = false, restore_off = false;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    uint64_t enterprise_binding = stopped_only && wapi_enabled == NULL ? esp32_mquickjs_wifi_radio_eap_identity() : 0;
    if (enterprise_binding) {
        err = wifi_begin_enterprise_restart(enterprise_binding, allow_ap_restart, &mode);
        if (err == ESP_OK) {
            s_wifi_configuration_cleanup = true;
            s_wifi_configuration_stop_only = false;
            s_wifi_configuration_disconnect_pending = false;
        }
    } else
#endif
    if (stopped_only) {
        esp32_mquickjs_wifi_radio_restart_selection_t selection = {.allow_ap_restart = allow_ap_restart};
        err = esp32_mquickjs_wifi_ap_begin_stopped_restart(&s_wifi_lifecycle, &selection);
        if (err == ESP_OK) {
            mode = selection.mode;
            cold_source = selection.cold;
            restore_off = selection.restore_off;
            s_wifi_configuration_cleanup = true;
            s_wifi_configuration_stop_only = false;
            s_wifi_configuration_disconnect_pending = false;
        }
    } else {
        err = wifi_begin_configuration_cleanup(false);
    }
    if (err != ESP_OK) goto free_ap;
    if (execution != NULL) execution->admitted = true;
    s_wifi_configuration_mode = mode;
    s_wifi_state.runtime_cleanup_pending = true;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (s_wifi_eap_stop.profile) {
        err = wifi_restart_enterprise_interfaces(stored_ap, allow_ap_restart, execution);
        goto free_ap;
    }
#endif
    esp32_mquickjs_wifi_radio_release(&s_wifi_application);
    esp32_mquickjs_wifi_radio_release(&s_wifi_state.radio_lease);
    const char *stage = "restart-checkpoint";
    esp32_mquickjs_wifi_radio_stop_snapshot_t stopped;
    esp32_mquickjs_wifi_radio_stop_snapshot(&stopped);
    if (!cold_source && (stopped_only || stopped.unchanged)) {
        /* Public stop may have removed every helper. Old-generation capture
         * can need a temporary Station START to read an inactive band, so
         * retire stale helper storage and prepare Station before capture. */
        stage = "restart-stopped-ap-retire";
        err = esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
        stage = "restart-stopped-station-retire";
        err = wifi_cleanup_helper(false);
        if (err != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
        stage = "restart-stopped-station-prepare";
        err = esp32_mquickjs_wifi_prepare_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
        if (!stopped.unchanged && (mode & WIFI_MODE_AP)) {
            /* Without qualified STOP history, checkpoint starts the current
             * configured source before reading runtime-only observations. */
            stage = "restart-stopped-ap-prepare";
            err = esp32_mquickjs_wifi_ap_prepare_for_configuration(&s_wifi_lifecycle);
            if (err != ESP_OK) goto pending;
        }
    }
    stage = "restart-checkpoint";
    if (execution != NULL) execution->stop_attempted = true;
    err = esp32_mquickjs_wifi_radio_checkpoint_restart_lifecycle(&s_wifi_lifecycle, mode);
    if (err != ESP_OK) goto pending;
    stage = "restart-ap-retire";
    err = esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    stage = "restart-station-retire";
    err = wifi_cleanup_helper(false);
    if (err != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
#if CONFIG_ESP_WIFI_WAPI_PSK
    if (wapi_enabled) {
        stage = "wapi-policy-select";
        err = esp32_mquickjs_wifi_radio_wapi_select(&s_wifi_lifecycle, mode, *wapi_enabled);
        if (err != ESP_OK) goto pending;
    }
#else
    (void)wapi_enabled;
#endif
    err = wifi_restart_restore_interfaces(mode, stored_ap, execution, restore_off);
    goto free_ap;
pending:
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = stage;
    s_wifi_state.cleanup_error = err;
    if (execution != NULL) execution->stage = stage;
free_ap:
    if (stored_ap != NULL) {
        esp32_mquickjs_wireless_secure_zero(stored_ap, sizeof(*stored_ap));
        esp32_mquickjs_memory_payload_free(stored_ap);
    }
    return err;
}

esp_err_t esp32_mquickjs_wifi_restart_interfaces(wifi_mode_t mode,
    esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    return wifi_restart_interfaces_inner(mode, false, execution, NULL, false);
}

esp_err_t esp32_mquickjs_wifi_restart_stopped_interfaces(
    bool allow_ap_restart, esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    return wifi_restart_interfaces_inner(WIFI_MODE_NULL, true, execution, NULL, allow_ap_restart);
}

/* Per-caller progress is kept across scheduler turns; the existing global
 * reservation is the sole authority. Public stop/runtime cleanup can consume
 * it, so every step checks identity before any driver/helper mutation. */
enum {
    WIFI_RECOVERY_NEW,
    WIFI_RECOVERY_CHECKPOINT,
    WIFI_RECOVERY_STOP,
    WIFI_RECOVERY_AP_RETIRE,
    WIFI_RECOVERY_STA_RETIRE,
    WIFI_RECOVERY_NATIVE_DRAIN,
    WIFI_RECOVERY_RESTORE,
    WIFI_RECOVERY_COMPLETE,
    WIFI_RECOVERY_FAILED,
};

