99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
void esp32_mquickjs_wifi_recovery_dispose(esp32_mquickjs_wifi_recovery_t *state)
{
    if (state == NULL) return;
    if (state->access_point != NULL) {
        esp32_mquickjs_wireless_secure_zero(state->access_point, sizeof(*state->access_point));
        esp32_mquickjs_memory_payload_free(state->access_point);
    }
    /* The central coordinator retains any admitted cleanup obligation. */
    memset(state, 0, sizeof(*state));
}

esp_err_t esp32_mquickjs_wifi_recovery_begin(
    esp32_mquickjs_wifi_recovery_t *state,
    const esp32_mquickjs_wifi_recovery_request_t *operation, bool allow_disconnect)
{
    if (state == NULL || state->phase != WIFI_RECOVERY_NEW || state->access_point != NULL ||
        state->lifecycle.identity != 0U || state->lifecycle.generation != 0U || operation == NULL ||
        operation->generation == 0U) return ESP_ERR_INVALID_ARG;
    bool generation_recovery = false;
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    generation_recovery = operation->kind == ESP32_MQUICKJS_WIFI_RECOVERY_TWT;
#endif
    if (generation_recovery ? operation->identity != 0U || !allow_disconnect : operation->identity == 0U)
        return ESP_ERR_INVALID_ARG;
    if (!generation_recovery && operation->kind != ESP32_MQUICKJS_WIFI_RECOVERY_ACTION
        && operation->kind != ESP32_MQUICKJS_WIFI_RECOVERY_RAW_TX
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
        && operation->kind != ESP32_MQUICKJS_WIFI_RECOVERY_FTM
#endif
    ) return ESP_ERR_INVALID_ARG;
    state->execution = (esp32_mquickjs_wifi_configuration_execution_t){.stage = "recovery-admission"};
    if (s_wifi_configuration_cleanup || s_wifi_ap_stop_cleanup || s_wifi_lifecycle.identity != 0U ||
        s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL ||
        !wifi_helpers_idle(allow_disconnect)) return ESP_ERR_INVALID_STATE;
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    /* Mode is resolved by atomic Radio admission; reserve fallible AP storage
     * before transferring any owner, including a later APSTA resolution. */
    state->access_point = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*state->access_point), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state->access_point == NULL) {
        state->execution.stage = "recovery-ap-allocate";
        return ESP_ERR_NO_MEM;
    }
#endif
    esp_err_t err = esp32_mquickjs_wifi_ap_begin_recovery(
        &s_wifi_application, &s_wifi_state.radio_lease, operation, &s_wifi_lifecycle, &state->mode);
    if (err != ESP_OK) {
        if (state->access_point != NULL) {
            esp32_mquickjs_wireless_secure_zero(state->access_point, sizeof(*state->access_point));
            esp32_mquickjs_memory_payload_free(state->access_point);
            state->access_point = NULL;
        }
        return err;
    }
    state->lifecycle = s_wifi_lifecycle;
    state->execution.admitted = true;
    state->phase = WIFI_RECOVERY_CHECKPOINT;
    s_wifi_configuration_cleanup = true;
    s_wifi_configuration_mode = state->mode;
    s_wifi_configuration_stop_only = false;
    wifi_lock();
    s_wifi_configuration_disconnect_pending = s_wifi_state.status.connected || s_wifi_state.connect_draining;
    wifi_unlock();
    s_wifi_state.runtime_cleanup_pending = true;
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_recovery_step(
    esp32_mquickjs_wifi_recovery_t *state, bool *complete)
{
    if (complete == NULL) return ESP_ERR_INVALID_ARG;
    *complete = false;
    if (state == NULL || state->phase == WIFI_RECOVERY_NEW ||
        state->phase == WIFI_RECOVERY_FAILED) return ESP_ERR_INVALID_STATE;
    if (state->phase == WIFI_RECOVERY_COMPLETE) { *complete = true; return ESP_OK; }
    if (!s_wifi_configuration_cleanup || state->lifecycle.identity == 0U ||
        state->lifecycle.identity != s_wifi_lifecycle.identity ||
        state->lifecycle.generation != s_wifi_lifecycle.generation) {
        state->execution.stage = "recovery-lifecycle-lost";
        state->phase = WIFI_RECOVERY_FAILED;
        return ESP_ERR_INVALID_STATE;
    }
    esp_err_t err = ESP_OK;
    const char *stage = "recovery-phase";
    switch (state->phase) {
    case WIFI_RECOVERY_CHECKPOINT:
        stage = "recovery-prepare";
        err = esp32_mquickjs_wifi_radio_prepare_recovery(&s_wifi_lifecycle);
        if (err != ESP_OK) break;
        stage = "recovery-disconnect";
        err = wifi_finish_configuration_disconnect();
        if (err != ESP_OK) break;
        esp32_mquickjs_wifi_radio_release(&s_wifi_application);
        esp32_mquickjs_wifi_radio_release(&s_wifi_state.radio_lease);
        stage = "recovery-checkpoint";
        state->execution.stop_attempted = true;
        err = esp32_mquickjs_wifi_radio_checkpoint_recovery(&s_wifi_lifecycle, state->mode);
        break;
    case WIFI_RECOVERY_STOP:
        stage = "recovery-stop";
        err = esp32_mquickjs_wifi_radio_stop_recovery(&s_wifi_lifecycle);
        break;
    case WIFI_RECOVERY_AP_RETIRE:
        stage = "recovery-ap-retire";
        err = esp32_mquickjs_wifi_ap_retire_for_recovery(&s_wifi_lifecycle);
        break;
    case WIFI_RECOVERY_STA_RETIRE:
        stage = "recovery-station-retire";
        err = esp32_mquickjs_wifi_retire_for_recovery(&s_wifi_lifecycle);
        if (err != ESP_OK && s_wifi_state.cleanup_stage != NULL) stage = s_wifi_state.cleanup_stage;
        break;
    case WIFI_RECOVERY_NATIVE_DRAIN:
        stage = "recovery-native-drain";
        err = esp32_mquickjs_wifi_radio_shutdown_recovery(&s_wifi_lifecycle);
        if (err == ESP_ERR_TIMEOUT) {
            /* Yield to the original native owner's Future or cleanup worker.
             * TWT drains before deinit; no owner lease is copied here. */
            state->execution.stage = stage;
            s_wifi_state.runtime_cleanup_pending = true;
            s_wifi_state.cleanup_stage = stage;
            s_wifi_state.cleanup_error = err;
            return ESP_OK;
        }
        if (err == ESP_OK) {
            stage = "recovery-restore-handoff";
            err = esp32_mquickjs_wifi_radio_finish_recovery(&s_wifi_lifecycle);
        }
        break;
    case WIFI_RECOVERY_RESTORE:
        /* Old helpers and the native owner have retired under this exact
         * lifecycle. Clear the stepper's drain diagnostics so helper init can
         * run; the central configuration reservation still owns cleanup, and
         * the restore suffix records any new failure before returning. */
        s_wifi_state.runtime_cleanup_pending = false;
        s_wifi_state.cleanup_stage = NULL;
        s_wifi_state.cleanup_error = ESP_OK;
        err = wifi_restart_restore_interfaces(state->mode, state->access_point, &state->execution, false);
        if (err != ESP_OK) { state->phase = WIFI_RECOVERY_FAILED; return err; }
        state->phase = WIFI_RECOVERY_COMPLETE;
        *complete = true;
        return ESP_OK;
    default:
        return ESP_ERR_INVALID_STATE;
    }
    state->execution.stage = stage;
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = stage;
    s_wifi_state.cleanup_error = err;
    if (err != ESP_OK) { state->phase = WIFI_RECOVERY_FAILED; return err; }
    ++state->phase;
    return ESP_OK;
}

