99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
static esp_err_t wifi_configure_selected_interfaces(
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    wifi_config_t *station, esp32_mquickjs_wifi_config_accept_fn accept_station,
    wifi_config_t *access_point, esp32_mquickjs_wifi_config_accept_fn accept_access_point,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    const esp32_mquickjs_wifi_radio_start_controls_t *start_controls,
    esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    if (execution != NULL) *execution = (esp32_mquickjs_wifi_configuration_execution_t){.stage = "admission"};
    if (selection == NULL || selection->station_set != (station != NULL) ||
        selection->access_point_set != (access_point != NULL) ||
        (station != NULL && accept_station == NULL) ||
        (access_point != NULL && accept_access_point == NULL)) return ESP_ERR_INVALID_ARG;
    if (s_wifi_configuration_cleanup || s_wifi_state.runtime_cleanup_pending ||
        s_wifi_state.cleanup_stage != NULL) return ESP_ERR_INVALID_STATE;
    if (access_point != NULL) {
        esp_err_t validated = esp32_mquickjs_wifi_radio_validate_ap_config(access_point);
        if (validated != ESP_OK) return validated;
    }
    bool already_started = false;
    esp_err_t err = selection->start_only
        ? wifi_begin_start_configuration(selection, &already_started)
        : wifi_begin_selected_configuration(selection, controls, start_controls);
    if (err != ESP_OK) return err;
    if (already_started) return wifi_start_existing_running(selection);
    if (execution != NULL) execution->admitted = true;
    wifi_mode_t mode = selection->mode;
    wifi_storage_t storage = selection->storage;
    bool start = selection->start;
    s_wifi_state.runtime_cleanup_pending = true;
    wifi_config_t *stored_ap = NULL;
    const char *stage = "start-ap-allocate";
    if (selection->start_only && (mode & WIFI_MODE_AP)) {
        stored_ap = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*stored_ap), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (stored_ap == NULL) { err = ESP_ERR_NO_MEM; goto pending; }
    }
    stage = "configuration-disconnect";
    err = wifi_finish_configuration_disconnect();
    if (err != ESP_OK) goto pending;
    esp32_mquickjs_wifi_radio_release(&s_wifi_application);
    esp32_mquickjs_wifi_radio_release(&s_wifi_state.radio_lease);
    stage = "configuration-stop";
    if (execution != NULL) execution->stop_attempted = true;
    err = esp32_mquickjs_wifi_radio_quiesce_lifecycle(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    stage = "configuration-ap-retire";
    err = esp32_mquickjs_wifi_ap_retire_for_configuration(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    err = wifi_cleanup_helper(false);
    if (err != ESP_OK) { stage = s_wifi_state.cleanup_stage; goto pending; }
    stage = "configuration-initialize";
    err = esp32_mquickjs_wifi_radio_initialize_lifecycle(&s_wifi_lifecycle);
    if (err != ESP_OK) goto pending;
    /* Prepare helper allocations/registrations before changing the configs.
     * The native transaction allocates its secure snapshots before its writes. */
    if (start && (mode & WIFI_MODE_STA)) {
        stage = "configuration-station-prepare";
        err = esp32_mquickjs_wifi_prepare_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
    }
    if (start && (mode & WIFI_MODE_AP)) {
        stage = "configuration-ap-prepare";
        err = esp32_mquickjs_wifi_ap_prepare_for_configuration(&s_wifi_lifecycle);
        if (err != ESP_OK) goto pending;
    }
    esp32_mquickjs_wifi_radio_lease_t *ap_slot = NULL;
    if (start && (mode & WIFI_MODE_AP)) {
        stage = "configuration-ap-slot";
        ap_slot = esp32_mquickjs_wifi_ap_configuration_slot(&s_wifi_lifecycle);
        if (ap_slot == NULL) { err = ESP_ERR_INVALID_STATE; goto pending; }
    }
    stage = "configuration-commit";
    esp32_mquickjs_wifi_radio_config_result_t result;
    if (execution != NULL) execution->configuration_attempted = true;
    err = esp32_mquickjs_wifi_radio_configure_lifecycle(&s_wifi_lifecycle,
        mode, storage, station, accept_station, access_point, accept_access_point, controls, &result);
    if (err != ESP_OK) goto pending;
    if (stored_ap != NULL) {
        stage = "start-ap-config";
        err = esp32_mquickjs_wifi_radio_copy_stopped_ap_configuration(&s_wifi_lifecycle, stored_ap);
        if (err != ESP_OK) goto pending;
    }
    stage = "configuration-resume";
    if (execution != NULL) execution->resume_attempted = true;
    err = esp32_mquickjs_wifi_radio_resume_lifecycle(&s_wifi_lifecycle, mode, start,
        start && (mode & WIFI_MODE_STA) ? &s_wifi_application : NULL,
        start && (mode & WIFI_MODE_STA) ? &s_wifi_state.radio_lease : NULL, ap_slot, start_controls);
    if (err != ESP_OK) goto pending;
    s_wifi_configuration_cleanup = false;
    s_wifi_configuration_mode = WIFI_MODE_NULL;
    s_wifi_state.runtime_cleanup_pending = false;
    s_wifi_state.cleanup_stage = NULL;
    s_wifi_state.cleanup_error = ESP_OK;
    if (execution != NULL) execution->stage = "complete";
    if (stored_ap != NULL) {
        esp32_mquickjs_wireless_secure_zero(stored_ap, sizeof(*stored_ap));
        esp32_mquickjs_memory_payload_free(stored_ap);
    }
    return ESP_OK;
pending:
    if (stored_ap != NULL) {
        esp32_mquickjs_wireless_secure_zero(stored_ap, sizeof(*stored_ap));
        esp32_mquickjs_memory_payload_free(stored_ap);
    }
    /* Inputs belong to the caller and are never retained here. A failed
     * transaction must be cleaned, never resumed with recycled secret storage. */
    s_wifi_state.runtime_cleanup_pending = true;
    s_wifi_state.cleanup_stage = stage;
    s_wifi_state.cleanup_error = err;
    if (execution != NULL) execution->stage = stage;
    return err;
}

/* No Future is registered yet. Defaults resolve atomically under the Radio
 * mutation lock: preserve storage/mode, require START, and supply only STA.
 * An existing AP/APSTA mode cannot pass admission without an AP config, and
 * foreign leases cannot pass the exclusive lifecycle reservation. */
esp_err_t esp32_mquickjs_wifi_prepare_connect(wifi_config_t *config)
{
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    if (config->sta.pmf_cfg.capable)
        return esp32_mquickjs_wifi_ensure_started();
    if (config->sta.pmf_cfg.required ||
        !esp32_mquickjs_wifi_radio_pmf_disable_allowed(WIFI_IF_STA, config))
        return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_radio_configuration_selection_t selection = {
        .station_set = true, .start_set = true, .start = true,
        .allow_disconnect = true,
    };
    return wifi_configure_selected_interfaces(&selection, config,
        esp32_mquickjs_wifi_radio_accept_station_config,
        NULL, NULL, NULL, NULL, NULL);
}

esp_err_t esp32_mquickjs_wifi_configure_interfaces(wifi_mode_t mode,
    wifi_storage_t storage, bool start, wifi_config_t *station,
    esp32_mquickjs_wifi_config_accept_fn accept_station, wifi_config_t *access_point,
    esp32_mquickjs_wifi_config_accept_fn accept_access_point,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    const esp32_mquickjs_wifi_radio_start_controls_t *start_controls, bool allow_disconnect)
{
    esp32_mquickjs_wifi_radio_configuration_selection_t selection = {
        .mode_set = true, .storage_set = true, .start_set = true,
        .mode = mode, .storage = storage, .start = start, .allow_disconnect = allow_disconnect,
        .station_set = station != NULL, .access_point_set = access_point != NULL,
    };
    return wifi_configure_selected_interfaces(&selection, station, accept_station,
        access_point, accept_access_point, controls, start_controls, NULL);
}

/* Caller has captured explicit allowDisconnect:true. Reuse the configuration
 * coordinator for STOP/fence, helper retirement, secure config readback and
 * START. On error only stop/runtime cleanup may consume the retained suffix;
 * the caller's credential buffer is never retained for automatic replay. */
esp_err_t esp32_mquickjs_wifi_activate_ap(wifi_config_t *config)
{
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_radio_configuration_selection_t selection = {
        .start_set = true, .start = true, .allow_disconnect = true,
        .access_point_set = true, .activate_ap = true,
    };
    return wifi_configure_selected_interfaces(&selection, NULL, NULL,
        config, esp32_mquickjs_wifi_radio_accept_ap_config, NULL, NULL, NULL);
#else
    (void)config;
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

esp_err_t esp32_mquickjs_wifi_apply_configuration(esp32_mquickjs_wifi_configuration_t *configuration,
    esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    if (execution != NULL) *execution = (esp32_mquickjs_wifi_configuration_execution_t){.stage = "admission"};
    if (configuration == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_radio_configuration_selection_t selection = {
        .mode_set = configuration->mode_set, .storage_set = configuration->storage_set,
        .start_set = configuration->start_set, .mode = configuration->mode,
        .storage = configuration->storage, .start = configuration->start,
        .allow_disconnect = configuration->allow_disconnect,
        .station_set = configuration->station_set, .access_point_set = configuration->access_point_set,
    };
    esp_err_t err = wifi_configure_selected_interfaces(&selection,
        configuration->station_set ? &configuration->station : NULL,
        esp32_mquickjs_wifi_radio_accept_station_config,
        configuration->access_point_set ? &configuration->access_point : NULL,
        esp32_mquickjs_wifi_radio_accept_ap_config, &configuration->controls, &configuration->start_controls, execution);
    if (err == ESP_OK) {
        configuration->mode = selection.mode;
        configuration->storage = selection.storage;
        configuration->start = selection.start;
    }
    return err;
}

JSValue js_wifi_configure(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.configure(options) expects one argument");
    esp32_mquickjs_wifi_configuration_t *configuration = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*configuration), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (configuration == NULL) return JS_ThrowOutOfMemory(ctx);
    bool captured = esp32_mquickjs_wifi_capture_configuration(ctx, argv[0], configuration);
    esp32_mquickjs_wifi_configuration_execution_t execution = {0};
    esp_err_t err = captured ? esp32_mquickjs_wifi_apply_configuration(configuration, &execution) : ESP_OK;
    esp32_mquickjs_wireless_secure_zero(configuration, sizeof(*configuration));
    esp32_mquickjs_memory_payload_free(configuration);
    if (!captured) return JS_EXCEPTION;
    if (err != ESP_OK) return esp32_mquickjs_wifi_throw_configuration_error(ctx, err, NULL, &execution);
    /* Result allocation is after commit. Preserve the accepted state on OOM;
     * callers inspect status before any explicit retry of a failed delivery. */
    return esp32_mquickjs_wifi_make_status_object(ctx);
}

static esp_err_t wifi_finish_runtime_cleanup(bool wait_for_terminal)
{
    if (s_wifi_configuration_cleanup) return wifi_finish_configuration_cleanup();
    esp_err_t vendor_error = esp32_mquickjs_wifi_radio_vendor_ie_clear(-1);
    if (vendor_error != ESP_OK) {
        s_wifi_state.cleanup_stage = "vendor-ie-clear";
        s_wifi_state.cleanup_error = vendor_error;
        return vendor_error;
    }
    if (s_wifi_state.cleanup_stage != NULL && !strcmp(s_wifi_state.cleanup_stage, "vendor-ie-clear")) {
        s_wifi_state.cleanup_stage = NULL;
        s_wifi_state.cleanup_error = ESP_OK;
    }
    if (!s_wifi_state.runtime_cleanup_pending) return wifi_cleanup_failed_init();
    TickType_t started = xTaskGetTickCount();
    for (;;) {
        (void)esp32_mquickjs_wifi_drain_scan();
        wifi_release_radio_operation();
        wifi_lock();
        bool scan_pending = s_wifi_state.scan_in_progress || s_wifi_state.scan_draining ||
            s_wifi_state.scan_results_pending || s_wifi_state.scan_start_active || s_wifi_state.scan_stop_active;
        bool connect_pending = s_wifi_state.connect_in_progress || s_wifi_state.connect_draining ||
            s_wifi_state.connect_start_active || s_wifi_state.disconnect_active;
        esp_err_t native_error = scan_pending ? s_wifi_state.scan_cleanup_error :
            s_wifi_state.disconnect_cleanup_error;
        wifi_unlock();
        if (!scan_pending && !connect_pending) {
            if (s_wifi_ap_stop_cleanup) {
                esp_err_t err = wifi_adopt_ap_stop_cleanup();
                if (err == ESP_OK) return wifi_finish_configuration_cleanup();
                s_wifi_state.cleanup_stage = "ap-stop-admission";
                s_wifi_state.cleanup_error = err;
                return err;
            }
            if (esp32_mquickjs_wifi_ap_control_lease() != NULL) {
                esp_err_t err = wifi_begin_configuration_cleanup(false);
                if (err == ESP_OK) return wifi_finish_configuration_cleanup();
                s_wifi_state.cleanup_stage = "configuration-admission";
                s_wifi_state.cleanup_error = err;
                return err;
            }
            return wifi_cleanup_failed_init();
        }
        if (!wait_for_terminal || native_error != ESP_OK ||
            (TickType_t)(xTaskGetTickCount() - started) >= pdMS_TO_TICKS(1000)) {
            s_wifi_state.cleanup_stage = scan_pending ? "scan-drain" : "connection-drain";
            s_wifi_state.cleanup_error = native_error != ESP_OK ? native_error : ESP_ERR_INVALID_STATE;
            return s_wifi_state.cleanup_error;
        }
        /* No JS/runtime consumer is attached here. Only native callbacks can
         * satisfy the barrier; the bounded wait never resubmits driver work. */
        vTaskDelay(1);
    }
}

