99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
bool esp32_mquickjs_init_wifi_runtime(JSContext *ctx,
                                      esp32_mquickjs_runtime_t *runtime)
{
    if (!esp32_mquickjs_init_wifi_wake_runtime(ctx)) return false;
    /* A new runtime is an explicit retry boundary for an unfinished helper
     * cleanup. Do not register a new consumer over retained callback storage. */
    if (s_wifi_state.runtime_cleanup_pending) {
        /* One explicit retry of unfinished native cancellation, followed by
         * a bounded wait for terminal notifications before attaching JS. */
        wifi_lock();
        bool cancel_connect = s_wifi_state.connect_in_progress ||
            s_wifi_state.connect_draining || s_wifi_state.status.connected;
        uint32_t connect_generation = s_wifi_state.connect_generation;
        uint32_t scan_generation = s_wifi_state.scan_generation;
        wifi_unlock();
        if (cancel_connect) (void)esp32_mquickjs_wifi_cancel_connect(connect_generation);
        (void)esp32_mquickjs_wifi_cancel_scan(scan_generation);
    }
    if ((s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL) &&
        wifi_finish_runtime_cleanup(true) != ESP_OK) {
        JS_ThrowInternalError(ctx, "Wi-Fi cleanup pending at %s: %s",
            s_wifi_state.cleanup_stage,
            esp_err_to_name(s_wifi_state.cleanup_error));
        return false;
    }
    /* A borrowed AP transaction must retire through the central coordinator
     * before the independent AP helper is allowed to attach another runtime. */
    if (!esp32_mquickjs_init_wifi_ap_runtime(ctx)) return false;
    s_wifi_runtime = runtime;
    if (!esp32_mquickjs_init_wifi_future_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
    if (!esp32_mquickjs_init_wifi_action_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (!esp32_mquickjs_init_wifi_twt_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (!esp32_mquickjs_init_wifi_ftm_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
#endif
#if CONFIG_ESP_WIFI_RRM_SUPPORT
    if (!esp32_mquickjs_init_wifi_neighbor_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
#endif
    if (!esp32_mquickjs_init_wifi_raw_tx_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (!esp32_mquickjs_init_wifi_smartconfig_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
    if (esp32_mquickjs_wifi_smartconfig_open_runtime() != ESP_OK) {
        JS_ThrowInternalError(ctx, "SmartConfig native cleanup or handles remain");
        s_wifi_runtime = NULL;
        return false;
    }
    if (!esp32_mquickjs_init_wifi_wps_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
    if (esp32_mquickjs_wifi_wps_open_runtime() != ESP_OK) {
        JS_ThrowInternalError(ctx, "WPS native cleanup or handles remain");
        s_wifi_runtime = NULL;
        return false;
    }
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    if (!esp32_mquickjs_init_wifi_dpp_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
    if (esp32_mquickjs_wifi_dpp_open_runtime() != ESP_OK) {
        JS_ThrowInternalError(ctx, "DPP native cleanup or handles remain");
        s_wifi_runtime = NULL;
        return false;
    }
#endif
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
    if (esp32_mquickjs_wifi_wps_ap_open_runtime() != ESP_OK) {
        JS_ThrowInternalError(ctx, "AP WPS native cleanup or handles remain");
        s_wifi_runtime = NULL;
        return false;
    }
#endif
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
    if (!esp32_mquickjs_init_wifi_nan_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
    if (esp32_mquickjs_wifi_nan_open_runtime() != ESP_OK) {
        JS_ThrowInternalError(ctx, "NAN native cleanup or handles remain");
        s_wifi_runtime = NULL;
        return false;
    }
#endif
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    if (!esp32_mquickjs_init_wifi_mesh_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
    if (esp32_mquickjs_wifi_mesh_open_runtime() != ESP_OK) {
        JS_ThrowInternalError(ctx, "Mesh native cleanup remains");
        s_wifi_runtime = NULL;
        return false;
    }
#endif
    if (!esp32_mquickjs_register_async_poller(
            runtime, wifi_driver_event_poller, NULL)) {
        JS_ThrowInternalError(ctx,
                              "failed to register Wi-Fi driver event poller");
        s_wifi_runtime = NULL;
        return false;
    }
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (esp32_mquickjs_wifi_eap_config_open() != ESP_OK) {
        JS_ThrowInternalError(ctx, "enterprise configuration retirement or revision exhausted");
        s_wifi_runtime = NULL;
        return false;
    }
    if (!esp32_mquickjs_init_wifi_enterprise_runtime(ctx, runtime)) {
        s_wifi_runtime = NULL;
        return false;
    }
#endif
    return true;
}

void esp32_mquickjs_deinit_wifi_runtime(JSContext *ctx)
{
    (void)ctx;
    /* Detach before waiting: callbacks that start now cannot retain the dying
     * runtime. Already-entered callbacks must exit before its storage is freed. */
    s_wifi_runtime = NULL;
    while (atomic_load_explicit(&s_wifi_state.callbacks_active, memory_order_acquire) != 0U)
        vTaskDelay(1);
    esp32_mquickjs_deinit_wifi_vendor_ie_watch_runtime();
    esp32_mquickjs_deinit_wifi_watch_runtime();
    esp32_mquickjs_deinit_wifi_wake_runtime();
    /* Keep a healthy AP owner until STA scan/connect have drained, then admit
     * all Wi-Fi owners together. Independent failed AP setup owns its own token
     * and continues through that helper's existing suffix instead. */
    bool coordinated = s_wifi_configuration_cleanup || s_wifi_ap_stop_cleanup ||
        esp32_mquickjs_wifi_ap_control_lease() != NULL;
    if (!coordinated) {
        esp32_mquickjs_deinit_wifi_ap_runtime();
        esp32_mquickjs_wifi_radio_release(&s_wifi_application);
    }
    if (!s_wifi_state.initialized) {
        if (coordinated) s_wifi_state.runtime_cleanup_pending = true;
        if (s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage != NULL)
            (void)wifi_finish_runtime_cleanup(false);
        return;
    }
    s_wifi_state.runtime_cleanup_pending = true;
    if (!s_wifi_state.cleanup_timer_stopped &&
        esp32_mquickjs_wifi_prepare_connect_timer() == ESP_OK)
        s_wifi_state.cleanup_timer_stopped = true;
    wifi_lock();
    bool cancel_connect = s_wifi_state.connect_in_progress ||
        s_wifi_state.connect_draining || s_wifi_state.status.connected;
    uint32_t connect_generation = s_wifi_state.connect_generation;
    uint32_t scan_generation = s_wifi_state.scan_generation;
    wifi_unlock();
    if (cancel_connect) (void)esp32_mquickjs_wifi_cancel_connect(connect_generation);
    (void)esp32_mquickjs_wifi_cancel_scan(scan_generation);

    wifi_lock();
    if (s_wifi_state.connect_generation != UINT32_MAX) s_wifi_state.connect_generation++;
    s_wifi_state.scan_future_registered = false;
    s_wifi_state.connect_future_registered = false;
    s_wifi_state.connection_future_operation = ESP32_MQUICKJS_WIFI_OPERATION_NONE;
    memset(&s_wifi_state.scan_future_token, 0, sizeof(s_wifi_state.scan_future_token));
    memset(&s_wifi_state.connect_future_token, 0, sizeof(s_wifi_state.connect_future_token));
    wifi_unlock();
    if (s_wifi_state.scan_queue != NULL) xQueueReset(s_wifi_state.scan_queue);
    if (s_wifi_state.connect_queue != NULL) xQueueReset(s_wifi_state.connect_queue);
    (void)wifi_finish_runtime_cleanup(false);
}

/* Runtime task only. Public stop disables the AP (including its clients), but
 * never disconnects a live Station or cancels a pending Future/foreign owner. */
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static esp_err_t wifi_begin_enterprise_stop(uint64_t binding)
{
    if (s_wifi_lifecycle.identity || s_wifi_ap_stop_cleanup || !wifi_helpers_idle(false))
        return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_eap_config_status_t config;
    esp32_mquickjs_wifi_eap_config_status(&config);
    esp32_mquickjs_wifi_eap_profile_t *profile = NULL;
    esp_err_t err = esp32_mquickjs_wifi_eap_config_begin(config.revision,
        ESP32_MQUICKJS_WIFI_EAP_CONFIG_DISABLE, &s_wifi_eap_stop.control, &profile);
    if (err != ESP_OK) return err;
    wifi_release_radio_operation();
    bool has_ap = esp32_mquickjs_wifi_ap_control_lease() != NULL;
    err = esp32_mquickjs_wifi_ap_begin_enterprise_stop(binding,
        &s_wifi_application, &s_wifi_state.radio_lease, &s_wifi_lifecycle);
    if (err != ESP_OK) {
        (void)esp32_mquickjs_wifi_eap_config_finish(&s_wifi_eap_stop.control, false);
        return err;
    }
    s_wifi_eap_stop.binding = binding;
    s_wifi_eap_stop.release_ap = true;
    s_wifi_configuration_cleanup = true;
    s_wifi_configuration_stop_only = true;
    s_wifi_configuration_disconnect_pending = false;
    s_wifi_configuration_mode = has_ap ? WIFI_MODE_APSTA : WIFI_MODE_STA;
    return ESP_OK;
}
#endif

static esp_err_t wifi_stop_idle(void)
{
    if (s_wifi_configuration_cleanup) return wifi_finish_configuration_cleanup();
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    esp32_mquickjs_wifi_eap_config_status_t config;
    esp32_mquickjs_wifi_eap_config_status(&config);
    if (config.busy || config.closing) return ESP_ERR_INVALID_STATE;
    uint64_t binding = esp32_mquickjs_wifi_radio_eap_identity();
    if (binding) {
        esp_err_t err = wifi_begin_enterprise_stop(binding);
        return err == ESP_OK ? wifi_finish_configuration_cleanup() : err;
    }
#endif
    if (s_wifi_ap_stop_cleanup) {
        esp_err_t err = wifi_adopt_ap_stop_cleanup();
        return err == ESP_OK ? wifi_finish_configuration_cleanup() : err;
    }
    if (s_wifi_lifecycle.identity == 0U && esp32_mquickjs_wifi_ap_control_lease() != NULL) {
        bool station_owner = s_wifi_application.acquired || s_wifi_state.radio_lease.acquired;
        esp_err_t err = wifi_begin_configuration_cleanup(false);
        if (err != ESP_OK) return err;
        s_wifi_configuration_stop_only = true;
        s_wifi_configuration_mode = station_owner ? WIFI_MODE_APSTA : WIFI_MODE_AP;
        return wifi_finish_configuration_cleanup();
    }
    if (s_wifi_lifecycle.identity == 0U) {
        if (!wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
        wifi_release_radio_operation();
        esp_err_t err = esp32_mquickjs_wifi_radio_begin_lifecycle(
            &s_wifi_application, &s_wifi_state.radio_lease, NULL, &s_wifi_lifecycle);
        if (err != ESP_OK) return err;
    }
    s_wifi_state.runtime_cleanup_pending = true;
    esp32_mquickjs_wifi_radio_release(&s_wifi_application);
    /* Successful prefixes are removed once; a failure keeps the reservation
     * and rejects new owners until stop/runtime cleanup retries the suffix. */
    return wifi_cleanup_failed_init();
}

JSValue js_wifi_start(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.start(options?) expects at most one argument");
    esp32_mquickjs_wifi_radio_configuration_selection_t selection;
    if (!esp32_mquickjs_wifi_capture_start(ctx, argc ? argv[0] : JS_UNDEFINED, &selection)) return JS_EXCEPTION;
    esp_err_t err = wifi_configure_selected_interfaces(&selection, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
    if (err != ESP_OK) return esp32_mquickjs_wifi_throw_operation_error(
        ctx, "WIFI_START_FAILED", "wifi.start", err, 0, 0);
    return wifi_make_status_object(ctx);
}

