99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
JSValue js_wifi_stop(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.stop(options?) expects at most one argument");
    uint32_t timeout_ms;
    if (!esp32_mquickjs_wifi_capture_stop(ctx, argc ? argv[0] : JS_UNDEFINED, &timeout_ms)) return JS_EXCEPTION;
    esp_err_t err = esp32_mquickjs_wifi_wait_begin(timeout_ms);
    if (err == ESP_OK) {
        err = wifi_stop_idle();
        esp32_mquickjs_wifi_wait_end();
    }
    if (err != ESP_OK) return esp32_mquickjs_wifi_throw_operation_error(
        ctx, "WIFI_STOP_FAILED", "wifi.stop", err, 0, 0);
    return wifi_make_status_object(ctx);
}

JSValue js_wifi_get_default_timeout_ms(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_WIFI_DEFAULT_TIMEOUT_MS);
}

static JSValue wifi_throw_restart_error(JSContext *ctx, esp_err_t error,
    const esp32_mquickjs_wifi_configuration_execution_t *execution)
{
    esp32_mquickjs_wifi_radio_status_t radio = {0};
    (void)esp32_mquickjs_wifi_radio_get_status(&radio);
    uint32_t snapshot_bytes = esp32_mquickjs_wifi_radio_restart_snapshot_bytes();
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", JS_NewString(ctx,
            execution->stage != NULL ? execution->stage : "restart-cleanup")) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, error)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espName", JS_NewString(ctx, esp_err_to_name(error))) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "lifecycleAdmitted", JS_NewBool(execution->admitted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "checkpointAttempted", JS_NewBool(execution->stop_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "replayAttempted", JS_NewBool(execution->configuration_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "resumeAttempted", JS_NewBool(execution->resume_attempted)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "cleanupPending", JS_NewBool(s_wifi_configuration_cleanup)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "restartRequired", JS_NewBool(radio.restart_required ||
            s_wifi_state.sta_detach_error != ESP_OK || esp32_mquickjs_wifi_ap_netif_cleanup_error() != ESP_OK)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "restartSnapshotBytes", JS_NewUint32(ctx, snapshot_bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "radioFaultStage", radio.fault_stage != NULL ? JS_NewString(ctx, radio.fault_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "radioFaultError", radio.fault_stage != NULL ? JS_NewInt32(ctx, radio.fault_error) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "configuration", execution->stop_attempted ?
            wifi_make_configuration_status(ctx, &radio.configuration) : JS_NULL)) {
        JS_PopGCRef(ctx, &ref);
        return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx, "WIFI_RESTART_FAILED",
        "wifi.driver.restart", "Wi-Fi driver restart failed", *details);
    JS_PopGCRef(ctx, &ref);
    return result;
}

JSValue js_wifi_driver_restart(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.driver.restart(options?) expects at most one argument");
    uint32_t timeout_ms;
    bool allow_ap_restart;
    if (!esp32_mquickjs_wifi_capture_restart(ctx, argc ? argv[0] : JS_UNDEFINED, &timeout_ms, &allow_ap_restart)) return JS_EXCEPTION;
    esp32_mquickjs_wifi_configuration_execution_t execution = {.stage = "restart-wait-admission"};
    esp_err_t err = esp32_mquickjs_wifi_wait_begin(timeout_ms);
    if (err == ESP_OK) {
        err = esp32_mquickjs_wifi_restart_stopped_interfaces(allow_ap_restart, &execution);
        esp32_mquickjs_wifi_wait_end();
    }
    if (err != ESP_OK) return wifi_throw_restart_error(ctx, err, &execution);
    return wifi_make_status_object(ctx);
}

static bool wifi_driver_helpers_ready(void)
{
    return !s_wifi_configuration_cleanup && !s_wifi_ap_stop_cleanup && s_wifi_lifecycle.identity == 0U &&
        !s_wifi_state.runtime_cleanup_pending && s_wifi_state.cleanup_stage == NULL && wifi_helpers_idle(true);
}

#if CONFIG_ESP_WIFI_WAPI_PSK
#include "esp32_mquickjs_wifi_wapi_public.inc"
#endif

#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_wifi_wps_station.inc"
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
#include "esp32_mquickjs_wifi_wps_ap_helper.inc"
#endif

esp_err_t esp32_mquickjs_wifi_smartconfig_capture_owners(esp32_mquickjs_wifi_radio_lease_t owners[3])
{
    if (!owners) return ESP_ERR_INVALID_ARG;
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    owners[0] = s_wifi_application;
    owners[1] = s_wifi_state.radio_lease;
    const esp32_mquickjs_wifi_radio_lease_t *ap = esp32_mquickjs_wifi_ap_control_lease();
    owners[2] = ap ? *ap : (esp32_mquickjs_wifi_radio_lease_t){0};
    return ESP_OK;
}

static bool wifi_smartconfig_connection_exact_locked(const esp32_mquickjs_wifi_radio_operation_t *owner,
    uint32_t generation)
{
    return owner && owner->identity && generation && generation == s_wifi_state.connect_generation &&
        generation == s_wifi_smartconfig_connect.generation &&
        owner->identity == s_wifi_smartconfig_connect.owner.identity &&
        owner->generation == s_wifi_smartconfig_connect.owner.generation &&
        owner->lease_identity == s_wifi_smartconfig_connect.owner.lease_identity &&
        owner->kind == s_wifi_smartconfig_connect.owner.kind;
}

static esp_err_t wifi_station_connect_submit(const esp32_mquickjs_wifi_radio_operation_t *owner,
    const wifi_config_t *config, uint32_t timeout_ms, uint32_t *generation)
{
    wifi_lock();
    s_wifi_smartconfig_connect.owner = *owner;
    s_wifi_smartconfig_connect.generation = ++s_wifi_state.connect_generation;
    s_wifi_smartconfig_connect.terminal = 0;
    s_wifi_smartconfig_connect.reason = 0;
    *generation = s_wifi_smartconfig_connect.generation;
    s_wifi_state.connection_future_operation = ESP32_MQUICKJS_WIFI_OPERATION_CONNECT;
    s_wifi_state.connect_start_active = true;
    wifi_unlock();
    esp_err_t error = wifi_start_connect_reserved(config, timeout_ms);
    wifi_lock();
    s_wifi_state.connect_start_active = false;
    wifi_unlock();
    /* A failed submission still returns its exact retained cleanup generation. */
    return error;
}

