99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
esp_err_t esp32_mquickjs_wifi_smartconfig_connect_begin(
    const esp32_mquickjs_wifi_radio_operation_t *owner, const wifi_config_t *config,
    uint32_t timeout_ms, uint32_t *generation)
{
    if (!owner || !config || !timeout_ms || !generation || *generation ||
        !config->sta.pmf_cfg.capable) return ESP_ERR_INVALID_ARG;
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(false)) {
        wifi_lock();
        bool draining = s_wifi_state.connect_draining && !esp32_mquickjs_wifi_connection_reserved_locked();
        wifi_unlock();
        return draining ? ESP_ERR_NOT_FINISHED : ESP_ERR_INVALID_STATE;
    }
    wifi_lock();
    bool exhausted = s_wifi_state.connect_generation == UINT32_MAX;
    wifi_unlock();
    if (exhausted) return ESP_ERR_NO_MEM;
    esp_err_t error = esp32_mquickjs_wifi_radio_smartconfig_connection_begin(owner);
    if (error != ESP_OK) return error;
    return wifi_station_connect_submit(owner, config, timeout_ms, generation);
}

esp_err_t esp32_mquickjs_wifi_smartconfig_connect_status(
    const esp32_mquickjs_wifi_radio_operation_t *owner, uint32_t generation,
    esp32_mquickjs_wifi_smartconfig_connection_status_t *status)
{
    if (!status) return ESP_ERR_INVALID_ARG;
    wifi_lock();
    bool exact = wifi_smartconfig_connection_exact_locked(owner, generation);
    *status = (esp32_mquickjs_wifi_smartconfig_connection_status_t){0};
    if (exact) *status = (esp32_mquickjs_wifi_smartconfig_connection_status_t){
        .generation = generation, .terminal = s_wifi_smartconfig_connect.terminal,
        .reason = s_wifi_smartconfig_connect.reason, .connected = s_wifi_state.status.connected,
        .draining = s_wifi_state.connect_draining || s_wifi_state.disconnect_active || s_wifi_state.connect_start_active,
    };
    wifi_unlock();
    return exact ? ESP_OK : ESP_ERR_INVALID_STATE;
}

esp_err_t esp32_mquickjs_wifi_smartconfig_connect_end(
    const esp32_mquickjs_wifi_radio_operation_t *owner, uint32_t generation, bool keep_connected)
{
    wifi_lock();
    bool exact = wifi_smartconfig_connection_exact_locked(owner, generation);
    bool keep = exact && keep_connected && !s_wifi_state.connect_in_progress &&
        s_wifi_smartconfig_connect.terminal == ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_SUCCESS &&
        s_wifi_state.status.connected && !s_wifi_state.connect_draining;
    wifi_unlock();
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    if (keep_connected && owner && owner->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_DPP) return ESP_ERR_INVALID_STATE;
#endif
    if (!exact || (keep_connected && !keep)) return ESP_ERR_INVALID_STATE;
    esp_err_t error = ESP_OK;
    if (!keep) error = wifi_request_disconnect();
    wifi_lock();
    bool pending = s_wifi_state.connect_in_progress || s_wifi_state.connect_draining ||
        s_wifi_state.connect_start_active || s_wifi_state.disconnect_active;
    wifi_unlock();
    if (error != ESP_OK || pending) return error != ESP_OK ? error : ESP_ERR_NOT_FINISHED;
    error = esp32_mquickjs_wifi_prepare_connect_timer();
    if (error != ESP_OK) return error;
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    if (owner->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_DPP)
        error = esp32_mquickjs_wifi_radio_dpp_connection_end(owner);
    else
#endif
        error = esp32_mquickjs_wifi_radio_smartconfig_connection_end(owner);
    if (error != ESP_OK) return error;
    wifi_lock();
    memset(&s_wifi_smartconfig_connect, 0, sizeof(s_wifi_smartconfig_connect));
    s_wifi_state.connection_future_operation = ESP32_MQUICKJS_WIFI_OPERATION_NONE;
    wifi_unlock();
    return ESP_OK;
}
#if CONFIG_ESP_WIFI_DPP_SUPPORT
esp_err_t esp32_mquickjs_wifi_dpp_connect_begin(uint32_t capture_identity,
    const esp32_mquickjs_wifi_radio_operation_t *owner, const wifi_config_t *config,
    uint32_t timeout_ms, uint32_t *generation)
{
    if (!owner || owner->kind != ESP32_MQUICKJS_WIFI_RADIO_OPERATION_DPP || !config ||
        !timeout_ms || !generation || *generation || !config->sta.pmf_cfg.capable) return ESP_ERR_INVALID_ARG;
    if (s_wifi_configuration_cleanup || s_wifi_ap_stop_cleanup || s_wifi_lifecycle.identity ||
        s_wifi_state.runtime_cleanup_pending || s_wifi_state.cleanup_stage || !s_wifi_state.sta_netif)
        return ESP_ERR_INVALID_STATE;
    wifi_lock();
    bool ready = capture_identity && capture_identity == s_wifi_wps_capture_identity && s_wifi_station_capture_dpp &&
        !s_wifi_smartconfig_connect.owner.identity && !s_wifi_state.connect_future_registered &&
        !s_wifi_state.scan_future_registered && !s_wifi_state.status.connected &&
        !s_wifi_state.connect_in_progress && !s_wifi_state.connect_draining && !s_wifi_state.connect_start_active &&
        !s_wifi_state.disconnect_active && !s_wifi_state.scan_in_progress && !s_wifi_state.scan_draining &&
        !s_wifi_state.scan_results_pending && !s_wifi_state.scan_start_active && !s_wifi_state.scan_stop_active;
    bool exhausted = s_wifi_state.connect_generation == UINT32_MAX;
    wifi_unlock();
    if (!ready || exhausted) return exhausted ? ESP_ERR_NO_MEM : ESP_ERR_INVALID_STATE;
    esp_err_t error = esp32_mquickjs_wifi_prepare_connect_timer();
    if (error != ESP_OK) return error;
    error = esp32_mquickjs_wifi_radio_dpp_connection_begin(owner);
    if (error != ESP_OK) return error;
    return wifi_station_connect_submit(owner, config, timeout_ms, generation);
}

esp_err_t esp32_mquickjs_wifi_dpp_connect_status(const esp32_mquickjs_wifi_radio_operation_t *owner,
    uint32_t generation, esp32_mquickjs_wifi_dpp_connection_status_t *status)
{
    if (!status || !owner || owner->kind != ESP32_MQUICKJS_WIFI_RADIO_OPERATION_DPP) return ESP_ERR_INVALID_ARG;
    *status = (esp32_mquickjs_wifi_dpp_connection_status_t){0};
    wifi_lock();
    bool exact = wifi_smartconfig_connection_exact_locked(owner, generation);
    if (exact) {
        status->generation = generation; status->terminal = s_wifi_smartconfig_connect.terminal;
        status->connected = s_wifi_state.status.connected;
        status->draining = s_wifi_state.connect_draining || s_wifi_state.disconnect_active || s_wifi_state.connect_start_active;
        status->reason = status->terminal == ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_SUCCESS && !status->connected ?
            s_wifi_state.status.last_disconnect_reason : s_wifi_smartconfig_connect.reason;
        if (status->connected) status->link = s_wifi_state.status.link;
    }
    wifi_unlock();
    return exact ? ESP_OK : ESP_ERR_INVALID_STATE;
}

