99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
esp_err_t esp32_mquickjs_wifi_dpp_connect_end(const esp32_mquickjs_wifi_radio_operation_t *owner,
    uint32_t generation)
{
    if (!owner || owner->kind != ESP32_MQUICKJS_WIFI_RADIO_OPERATION_DPP) return ESP_ERR_INVALID_ARG;
    return esp32_mquickjs_wifi_smartconfig_connect_end(owner, generation, false);
}
#endif

#endif

#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
/* Runtime-only snapshot. Worker receives values, never mutable helper pointers;
 * Radio revalidates all exact identities under its operation mutex. */
esp_err_t esp32_mquickjs_wifi_eap_capture_owners(esp32_mquickjs_wifi_radio_lease_t owners[3])
{
    if (!owners) return ESP_ERR_INVALID_ARG;
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    owners[0] = s_wifi_application;
    owners[1] = s_wifi_state.radio_lease;
    const esp32_mquickjs_wifi_radio_lease_t *ap = esp32_mquickjs_wifi_ap_control_lease();
    owners[2] = ap ? *ap : (esp32_mquickjs_wifi_radio_lease_t){0};
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_eap_activate(esp32_mquickjs_wifi_eap_profile_t *profile,
    esp32_mquickjs_wifi_eap_install_result_t *result)
{
    if (!result || !profile) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_eap_install_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(false)) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_eap_install(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), profile, result);
}

bool esp32_mquickjs_wifi_eap_prepare_runtime_destroy(void)
{
    esp32_mquickjs_wifi_eap_config_begin_close();
    if (s_wifi_eap_stop.control.identity && wifi_finish_configuration_cleanup() != ESP_OK)
        return false;
    esp32_mquickjs_wifi_eap_config_status_t config;
    esp32_mquickjs_wifi_eap_config_status(&config);
    if (config.busy) return false;
    uint64_t identity = esp32_mquickjs_wifi_radio_eap_identity();
    if (!identity) return esp32_mquickjs_wifi_eap_config_finish_close();
    /* Reuse native disconnect/epoch/fence handling. An observed DISCONNECTED
     * terminal alone is insufficient: idle also requires the reuse barrier. */
    bool pending = false;
    if (esp32_mquickjs_wifi_start_disconnect(&pending) != ESP_OK || pending) return false;
    (void)esp32_mquickjs_wifi_drain_scan();
    wifi_release_radio_operation();
    if (!wifi_helpers_idle(false)) return false;
    esp32_mquickjs_wifi_eap_install_result_t result;
    return esp32_mquickjs_wifi_radio_eap_clear(identity, &result) == ESP_OK &&
        esp32_mquickjs_wifi_eap_config_finish_close();
}

esp_err_t esp32_mquickjs_wifi_eap_disconnect_ready(bool *ready)
{
    if (!ready) return ESP_ERR_INVALID_ARG;
    *ready = false;
    bool pending = false;
    esp_err_t error = esp32_mquickjs_wifi_start_disconnect(&pending);
    if (error != ESP_OK || pending) return error;
    (void)esp32_mquickjs_wifi_drain_scan();
    wifi_release_radio_operation();
    *ready = wifi_helpers_idle(false);
    return ESP_OK;
}
#endif

#if CONFIG_ESP_WIFI_RRM_SUPPORT || CONFIG_ESP_WIFI_WNM_SUPPORT
esp_err_t esp32_mquickjs_wifi_roaming_execute(const esp32_mquickjs_wifi_btm_query_t *query,
    esp32_mquickjs_wifi_roaming_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_roaming_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready()) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_roaming(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), query, result);
}
#endif

#if CONFIG_ESP_WIFI_RRM_SUPPORT
esp_err_t esp32_mquickjs_wifi_rrm_reserve(esp32_mquickjs_wifi_radio_operation_t *token)
{
    if (!wifi_driver_helpers_ready()) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_rrm_reserve(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), token);
}
#endif

esp_err_t esp32_mquickjs_wifi_apply_interval(uint16_t milliseconds,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready()) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_write_interval(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), milliseconds, result);
}

esp_err_t esp32_mquickjs_wifi_apply_policy(esp32_mquickjs_wifi_policy_control_t control,
    wifi_interface_t interface, bool requested, bool *accepted,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (accepted == NULL || result == NULL) return ESP_ERR_INVALID_ARG;
    *accepted = false;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready()) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_write_policy(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), control, interface, requested, accepted, result);
}

esp_err_t esp32_mquickjs_wifi_apply_band(bool band_mode, int32_t requested,
    int32_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual == NULL || result == NULL) return ESP_ERR_INVALID_ARG;
    *actual = 0;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready()) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_change_band(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), band_mode, requested, actual, result);
}

#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
esp_err_t esp32_mquickjs_wifi_apply_twt_control(esp32_mquickjs_wifi_twt_control_kind_t kind,
    esp32_mquickjs_wifi_twt_control_t *value, uint32_t *generation,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (!value || !generation || !result) return ESP_ERR_INVALID_ARG;
    *generation = 0;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(true)) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_twt_control(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), kind, value, generation, result);
}
#endif

esp_err_t esp32_mquickjs_wifi_apply_he_statistics(bool rx, uint8_t selection, bool enabled,
    esp32_mquickjs_wifi_he_statistics_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (!actual || !result) return ESP_ERR_INVALID_ARG;
    *actual = (esp32_mquickjs_wifi_he_statistics_t){0};
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(true)) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_write_he_statistics(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), rx, selection, enabled, actual, result);
}

esp_err_t esp32_mquickjs_wifi_apply_scan_parameters(const wifi_scan_default_params_t *requested,
    wifi_scan_default_params_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual == NULL || result == NULL) return ESP_ERR_INVALID_ARG;
    memset(actual, 0, sizeof(*actual));
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    if (!wifi_driver_helpers_ready() || !wifi_helpers_idle(true)) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_write_scan_parameters(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), requested, actual, result);
}

esp_err_t esp32_mquickjs_wifi_apply_connection_control(
    esp32_mquickjs_wifi_connection_control_t control, wifi_interface_t interface,
    int32_t requested, int32_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual == NULL || result == NULL) return ESP_ERR_INVALID_ARG;
    *actual = 0;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "helper-admission", .error = ESP_ERR_INVALID_STATE};
    /* Runtime task only. No implicit helper/driver initialization and no SDK
     * calls while holding the helper mutex. Radio revalidates every identity. */
    if (!wifi_driver_helpers_ready()) return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_radio_connection_control(&s_wifi_application, &s_wifi_state.radio_lease,
        esp32_mquickjs_wifi_ap_control_lease(), control, interface, requested, actual, result);
}

