99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi.c
JSValue js_wifi_set_power_save(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    JSCStringBuf buffer;
    const char *text;
    const char *actual_text;
    wifi_ps_type_t requested;
    wifi_ps_type_t actual;
    esp_err_t err;

    (void)this_val;
    if (argc != 1 || !JS_IsString(ctx, argv[0]) ||
        (text = JS_ToCString(ctx, argv[0], &buffer)) == NULL) {
        return JS_ThrowTypeError(
            ctx, "wifi.setPowerSave(mode) expects none, minimum, or maximum");
    }
    if (strcmp(text, "none") == 0) {
        requested = WIFI_PS_NONE;
    } else if (strcmp(text, "minimum") == 0) {
        requested = WIFI_PS_MIN_MODEM;
    } else if (strcmp(text, "maximum") == 0) {
        requested = WIFI_PS_MAX_MODEM;
    } else {
        return JS_ThrowRangeError(
            ctx, "wifi.setPowerSave(mode) expects none, minimum, or maximum");
    }
    err = esp32_mquickjs_wifi_ensure_started();
    if (err == ESP_OK) {
        err = esp32_mquickjs_wifi_radio_set_power_save(
            &s_wifi_state.radio_lease, requested, &actual);
    }
    actual_text = err == ESP_OK ? wifi_power_save_to_string(actual) : NULL;
    if (err != ESP_OK || actual_text == NULL) {
        return JS_ThrowInternalError(
            ctx, "wifi.setPowerSave() failed: %s", esp_err_to_name(err));
    }
    return JS_NewString(ctx, actual_text);
}

JSValue js_wifi_set_tx_power(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    double dbm;
    double quarter_dbm;
    int8_t requested;
    int8_t actual;
    esp_err_t err;

    (void)this_val;
    if (argc != 1 || JS_ToNumber(ctx, &dbm, argv[0]) != 0 ||
        !isfinite(dbm) || dbm < 2.0 || dbm > 20.0) {
        return JS_ThrowRangeError(
            ctx, "wifi.setTxPower(dbm) expects 2..20 dBm");
    }
    quarter_dbm = dbm * 4.0;
    if (floor(quarter_dbm) != quarter_dbm) {
        return JS_ThrowRangeError(
            ctx, "wifi.setTxPower(dbm) expects 0.25 dBm increments");
    }
    requested = (int8_t)quarter_dbm;
    err = esp32_mquickjs_wifi_ensure_started();
    if (err == ESP_OK) {
        err = esp32_mquickjs_wifi_radio_set_tx_power(
            &s_wifi_state.radio_lease, requested, &actual);
    }
    if (err != ESP_OK) {
        return JS_ThrowInternalError(
            ctx, "wifi.setTxPower() failed: %s", esp_err_to_name(err));
    }
    return JS_NewFloat64(ctx, (double)actual / 4.0);
}

static bool wifi_control_enum(JSContext *ctx, JSValue value, const char *name)
{
    JSCStringBuf buffer;
    size_t length;
    const char *text;
    return JS_IsString(ctx, value) &&
        (text = JS_ToCStringLen(ctx, &length, value, &buffer)) != NULL &&
        length == strlen(name) && memcmp(text, name, length) == 0;
}

static JSValue wifi_control_error(JSContext *ctx, const char *code, const char *operation,
                                  esp_err_t err, const esp32_mquickjs_wifi_radio_mutation_t *mutation)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", mutation->stage ? JS_NewString(ctx, mutation->stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "driverAccepted", JS_NewBool(mutation->driver_accepted))) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx, code, operation,
        "Wi-Fi control operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

JSValue js_wifi_set_mac(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 2) return JS_ThrowTypeError(ctx, "wifi.setMac(interface, address) expects two arguments");
    wifi_interface_t interface;
    if (!wifi_parse_interface(ctx, argv[0], &interface)) return JS_EXCEPTION;
    if (!JS_IsString(ctx, argv[1])) return JS_ThrowTypeError(ctx, "wifi.setMac address must be a MAC string");
    JSCStringBuf buffer;
    size_t length;
    const char *text = JS_ToCStringLen(ctx, &length, argv[1], &buffer);
    if (text == NULL) return JS_EXCEPTION;
    uint8_t requested[6], actual[6];
    if (length != 17 || !esp32_mquickjs_wireless_parse_address(text, requested) ||
        (requested[0] & 1U) != 0 || memcmp(requested, "\0\0\0\0\0\0", 6) == 0)
        return JS_ThrowTypeError(ctx, "wifi.setMac expects a nonzero unicast MAC in xx:xx:xx:xx:xx:xx form");
    esp32_mquickjs_wifi_radio_mutation_t mutation;
    esp_err_t err = esp32_mquickjs_wifi_radio_set_mac(interface, requested, actual, &mutation);
    if (err != ESP_OK) return wifi_control_error(ctx, "WIFI_MAC_SET_FAILED", "wifi.setMac", err, &mutation);
    char address[18];
    esp32_mquickjs_wireless_format_address(actual, address);
    return JS_NewString(ctx, address);
}

JSValue js_wifi_set_country(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc < 1 || argc > 2 || !JS_IsString(ctx, argv[0]))
        return JS_ThrowTypeError(ctx, "wifi.setCountry(code, options?) expects a country code");
    JSCStringBuf buffer;
    size_t length;
    const char *text = JS_ToCStringLen(ctx, &length, argv[0], &buffer);
    if (text == NULL) return JS_EXCEPTION;
    if (length != 2 || !((text[0] >= 'A' && text[0] <= 'Z' && text[1] >= 'A' && text[1] <= 'Z') ||
                        (text[0] == '0' && text[1] == '1')))
        return JS_ThrowTypeError(ctx, "wifi.setCountry code must be two uppercase letters or 01");
    char code[3] = {text[0], text[1], 0};
    bool ieee80211d = true, policy_supplied = false;
    JSGCRef options_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    if (argc == 2) {
        static const char *const keys[] = {"policy", "ieee80211d"};
        *options = argv[1];
        if (!esp32_mquickjs_validate_plain_options(ctx, *options, "wifi.setCountry", keys, 2)) goto fail;
        *value = JS_GetPropertyStr(ctx, *options, "policy");
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsUndefined(*value)) {
            policy_supplied = true;
            if (wifi_control_enum(ctx, *value, "auto")) ieee80211d = true;
            else if (wifi_control_enum(ctx, *value, "manual")) ieee80211d = false;
            else {
                JS_ThrowTypeError(ctx, "wifi.setCountry policy must be auto or manual");
                goto fail;
            }
        }
        *value = JS_GetPropertyStr(ctx, *options, "ieee80211d");
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsUndefined(*value)) {
            if (!JS_IsBool(*value) || (policy_supplied && ieee80211d != (*value == JS_TRUE))) {
                JS_ThrowTypeError(ctx, "wifi.setCountry ieee80211d must be boolean and agree with policy");
                goto fail;
            }
            ieee80211d = *value == JS_TRUE;
        }
    }
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    wifi_country_t actual;
    esp32_mquickjs_wifi_radio_mutation_t mutation;
    esp_err_t err = esp32_mquickjs_wifi_radio_set_country_code(
        &s_wifi_state.radio_lease, code, ieee80211d, &actual, &mutation);
    if (err != ESP_OK) return wifi_control_error(ctx, "WIFI_COUNTRY_FAILED", "wifi.setCountry", err, &mutation);
    return esp32_mquickjs_wifi_country_to_js(ctx, &actual);
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_set_channel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    uint32_t channel;
    if (argc < 1 || argc > 2 ||
        !esp32_mquickjs_value_to_bounded_u32(ctx, argv[0], 1, 177, &channel) ||
        (channel > 14 && esp32_mquickjs_wifi_radio_5ghz_channel_bit(channel) == 0))
        return JS_ThrowTypeError(ctx, "wifi.setChannel expects a valid channel number");
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (channel > 14) return JS_ThrowTypeError(ctx, "wifi.setChannel 5 GHz is unsupported on this target");
#endif
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    JSGCRef options_ref, value_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    if (argc == 2) {
        static const char *const keys[] = {"secondaryChannel"};
        *options = argv[1];
        if (!esp32_mquickjs_validate_plain_options(ctx, *options, "wifi.setChannel", keys, 1)) goto fail;
        *value = JS_GetPropertyStr(ctx, *options, "secondaryChannel");
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsUndefined(*value)) {
            if (wifi_control_enum(ctx, *value, "none")) secondary = WIFI_SECOND_CHAN_NONE;
            else if (wifi_control_enum(ctx, *value, "above")) secondary = WIFI_SECOND_CHAN_ABOVE;
            else if (wifi_control_enum(ctx, *value, "below")) secondary = WIFI_SECOND_CHAN_BELOW;
            else {
                JS_ThrowTypeError(ctx, "wifi.setChannel secondaryChannel must be none, above or below");
                goto fail;
            }
        }
    }
    if (channel > 14 && secondary != WIFI_SECOND_CHAN_NONE) {
        JS_ThrowTypeError(ctx, "wifi.setChannel 5 GHz secondary channel is determined by the driver");
        goto fail;
    }
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    const esp32_mquickjs_wifi_radio_lease_t *lease = esp32_mquickjs_wifi_ap_control_lease();
    if (lease == NULL) lease = &s_wifi_state.radio_lease;
    uint8_t actual_primary;
    wifi_second_chan_t actual_secondary;
    uint32_t generation;
    esp32_mquickjs_wifi_radio_mutation_t mutation;
    esp_err_t err = esp32_mquickjs_wifi_radio_change_channel(lease, channel, secondary,
        &actual_primary, &actual_secondary, &generation, &mutation);
    if (err != ESP_OK) return wifi_control_error(ctx, "WIFI_CHANNEL_FAILED", "wifi.setChannel", err, &mutation);
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    const char *band = actual_primary >= 1 && actual_primary <= 14 ? "2.4GHz" :
        esp32_mquickjs_wifi_radio_5ghz_channel_bit(actual_primary) ? "5GHz" : NULL;
    const char *actual_second = actual_secondary == WIFI_SECOND_CHAN_NONE ? "none" :
        actual_secondary == WIFI_SECOND_CHAN_ABOVE ? "above" :
        actual_secondary == WIFI_SECOND_CHAN_BELOW ? "below" : NULL;
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channel", JS_NewUint32(ctx, actual_primary)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "secondaryChannel", actual_second ? JS_NewString(ctx, actual_second) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "band", band ? JS_NewString(ctx, band) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channelGeneration", JS_NewUint32(ctx, generation))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return JS_EXCEPTION;
}

